ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F580_IM
//  C8051F580_IQ
//  C8051F581_IM
//  C8051F581_IQ
//  C8051F582_IM
//  C8051F582_IQ
//  C8051F583_IM
//  C8051F583_IQ
//  C8051F584_IM
//  C8051F584_IQ
//  C8051F585_IM
//  C8051F585_IQ
//  C8051F586_IM
//  C8051F586_IQ
//  C8051F587_IM
//  C8051F587_IQ
//  C8051F588_IM
//  C8051F589_IM
//  C8051F590_IM
//  C8051F591_IM
//  C8051F592_AM

#ifndef SI_C8051F580_REGISTER_ENUMS_H
#define SI_C8051F580_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F580_Defs.h"
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_GAINEN__BMASK    0x01 ///< Gain Access Enable                            
#define ADC0CF_GAINEN__SHIFT    0x00 ///< Gain Access Enable                            
#define ADC0CF_GAINEN__DISABLED 0x00 ///< Disable access to the internal gain registers.
#define ADC0CF_GAINEN__ENABLED  0x01 ///< Enable access to the internal gain registers. 
                                                                                        
#define ADC0CF_ADRPT__FMASK     0x06 ///< Repeat Count                                  
#define ADC0CF_ADRPT__SHIFT     0x01 ///< Repeat Count                                  
#define ADC0CF_ADRPT__ACC_1     0x00 ///< Perform and Accumulate 1 conversion.          
#define ADC0CF_ADRPT__ACC_4     0x02 ///< Perform and Accumulate 4 conversions.         
#define ADC0CF_ADRPT__ACC_8     0x04 ///< Perform and Accumulate 8 conversions.         
#define ADC0CF_ADRPT__ACC_16    0x06 ///< Perform and Accumulate 16 conversions.        
                                                                                        
#define ADC0CF_ADSC__FMASK      0xF8 ///< SAR Clock Divider                             
#define ADC0CF_ADSC__SHIFT      0x03 ///< SAR Clock Divider                             
                                                                                        
//------------------------------------------------------------------------------
// ADC0CN Enums (ADC0 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN_ADCM__FMASK            0x03 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__SHIFT            0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__ADBUSY           0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN_ADCM__TIMER1           0x01 ///< ADC0 conversion initiated on overflow of Timer 1. 
#define ADC0CN_ADCM__CNVSTR           0x02 ///< ADC0 conversion initiated on rising edge of       
                                           ///< CNVSTR.                                           
#define ADC0CN_ADCM__TIMER2           0x03 ///< ADC0 conversion initiated on overflow of Timer 2. 
                                                                                                  
#define ADC0CN_ADLJST__BMASK          0x04 ///< Justification Select                              
#define ADC0CN_ADLJST__SHIFT          0x02 ///< Justification Select                              
#define ADC0CN_ADLJST__RIGHT          0x00 ///< Data in ADC0H:L is right-justified.               
#define ADC0CN_ADLJST__LEFT           0x04 ///< Data in ADC0H:L is left-justified. This option    
                                           ///< should not be used with a repeat count greater    
                                           ///< than 1 (ADRPT set to any value other than 0).     
                                                                                                  
#define ADC0CN_ADWINT__BMASK          0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__SHIFT          0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__NOT_SET        0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN_ADWINT__SET            0x08 ///< An ADC window compare event occurred.             
                                                                                                  
#define ADC0CN_ADBUSY__BMASK          0x10 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__SHIFT          0x04 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__NOT_SET        0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN_ADBUSY__SET            0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                           ///< conversion.                                       
                                                                                                  
#define ADC0CN_ADINT__BMASK           0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT           0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET         0x00 ///< ADC0 has not completed a conversion since the last
                                           ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET             0x20 ///< ADC0 completed a data conversion.                 
                                                                                                  
#define ADC0CN_ADBMEN__BMASK          0x40 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__SHIFT          0x06 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__BURST_DISABLED 0x00 ///< Disable ADC0 Burst Mode.                          
#define ADC0CN_ADBMEN__BURST_ENABLED  0x40 ///< Enable ADC0 Burst Mode.                           
                                                                                                  
