ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define ADC0CN_ADEN__BMASK            0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT            0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED         0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN_ADEN__ENABLED          0x80 ///< Enable ADC0 (active and ready for data            
                                           ///< conversions).                                     
                                                                                                  
//------------------------------------------------------------------------------
// ADC0GNA Enums (ADC0 Adjustable Selectable Gain @ 0x08)
//------------------------------------------------------------------------------
#define ADC0GNA_GAINADD__BMASK    0x01 ///< Additional Gain Control                         
#define ADC0GNA_GAINADD__SHIFT    0x00 ///< Additional Gain Control                         
#define ADC0GNA_GAINADD__DISABLED 0x00 ///< Do not add any additional gain to the value in  
                                       ///< ADC0GNH:L.                                      
#define ADC0GNA_GAINADD__ENABLED  0x01 ///< Add 1/64 (0.016) gain to the value in ADC0GNH:L.
                                                                                            
//------------------------------------------------------------------------------
// ADC0GNH Enums (ADC0 Selectable Gain High @ 0x04)
//------------------------------------------------------------------------------
#define ADC0GNH_GAINH__FMASK 0xFF ///< Selectable Gain High
#define ADC0GNH_GAINH__SHIFT 0x00 ///< Selectable Gain High
                                                           
//------------------------------------------------------------------------------
// ADC0GNL Enums (ADC0 Selectable Gain Low @ 0x07)
//------------------------------------------------------------------------------
#define ADC0GNL_GAINL__FMASK 0xF0 ///< Selectable Gain Low
#define ADC0GNL_GAINL__SHIFT 0x04 ///< Selectable Gain Low
                                                          
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x3F ///< AMUX Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select channel ADC0.0.       
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select channel ADC0.1.       
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select channel ADC0.2.       
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select channel ADC0.3.       
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select channel ADC0.4.       
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select channel ADC0.5.       
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select channel ADC0.6.       
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select channel ADC0.7.       
#define ADC0MX_ADC0MX__ADC0P8  0x08 ///< Select channel ADC0.8.       
#define ADC0MX_ADC0MX__ADC0P9  0x09 ///< Select channel ADC0.9.       
#define ADC0MX_ADC0MX__ADC0P10 0x0A ///< Select channel ADC0.10.      
#define ADC0MX_ADC0MX__ADC0P11 0x0B ///< Select channel ADC0.11.      
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select channel ADC0.12.      
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select channel ADC0.13.      
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select channel ADC0.14.      
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select channel ADC0.15.      
#define ADC0MX_ADC0MX__ADC0P16 0x10 ///< Select channel ADC0.16.      
#define ADC0MX_ADC0MX__ADC0P17 0x11 ///< Select channel ADC0.17.      
#define ADC0MX_ADC0MX__ADC0P18 0x12 ///< Select channel ADC0.18.      
#define ADC0MX_ADC0MX__ADC0P19 0x13 ///< Select channel ADC0.19.      
#define ADC0MX_ADC0MX__ADC0P20 0x14 ///< Select channel ADC0.20.      
#define ADC0MX_ADC0MX__ADC0P21 0x15 ///< Select channel ADC0.21.      
#define ADC0MX_ADC0MX__ADC0P22 0x16 ///< Select channel ADC0.22.      
#define ADC0MX_ADC0MX__ADC0P23 0x17 ///< Select channel ADC0.23.      
#define ADC0MX_ADC0MX__ADC0P24 0x18 ///< Select channel ADC0.24.      
#define ADC0MX_ADC0MX__ADC0P25 0x19 ///< Select channel ADC0.25.      
#define ADC0MX_ADC0MX__ADC0P26 0x1A ///< Select channel ADC0.26.      
#define ADC0MX_ADC0MX__ADC0P27 0x1B ///< Select channel ADC0.27.      
#define ADC0MX_ADC0MX__ADC0P28 0x1C ///< Select channel ADC0.28.      
#define ADC0MX_ADC0MX__ADC0P29 0x1D ///< Select channel ADC0.29.      
#define ADC0MX_ADC0MX__ADC0P30 0x1E ///< Select channel ADC0.30.      
#define ADC0MX_ADC0MX__ADC0P31 0x1F ///< Select channel ADC0.31.      
#define ADC0MX_ADC0MX__TEMP    0x30 ///< Temperature Sensor.          
#define ADC0MX_ADC0MX__VDD     0x31 ///< VDD Supply Voltage.          
#define ADC0MX_ADC0MX__GND     0x3F ///< Ground.                      
                                                                      
//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xBA)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK         0x03 ///< Post Tracking Time                                
#define ADC0TK_ADTK__SHIFT         0x00 ///< Post Tracking Time                                
#define ADC0TK_ADTK__2_SAR_CLOCKS  0x00 ///< Post-Tracking time is equal to 2 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__4_SAR_CLOCKS  0x01 ///< Post-Tracking time is equal to 4 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__8_SAR_CLOCKS  0x02 ///< Post-Tracking time is equal to 8 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__16_SAR_CLOCKS 0x03 ///< Post-Tracking time is equal to 16 SAR clock cycles
                                        ///< + 2 FADCCLK cycles.                               
                                                                                               
#define ADC0TK_ADTM__FMASK         0x0C ///< Tracking Mode                                     
#define ADC0TK_ADTM__SHIFT         0x02 ///< Tracking Mode                                     
#define ADC0TK_ADTM__POST_TRACKING 0x04 ///< ADC0 is configured to Post-Tracking Mode.         
#define ADC0TK_ADTM__PRE_TRACKING  0x08 ///< ADC0 is configured to Pre-Tracking Mode.          
#define ADC0TK_ADTM__DUAL_TRACKING 0x0C ///< ADC0 is configured to Dual-Tracking Mode.         
                                                                                               
#define ADC0TK_ADPWR__FMASK        0xF0 ///< Burst Mode Power Up Time                          
#define ADC0TK_ADPWR__SHIFT        0x04 ///< Burst Mode Power Up Time                          
                                                                                               
//------------------------------------------------------------------------------
// CAN0BRPE Enums (CAN BRP Extension @ 0xA1)
//------------------------------------------------------------------------------
#define CAN0BRPE_BRPE__FMASK 0x0F ///< Baud Rate Prescaler Extension
#define CAN0BRPE_BRPE__SHIFT 0x00 ///< Baud Rate Prescaler Extension
                                                                    
//------------------------------------------------------------------------------
// CAN0BTH Enums (CAN Bit Timing High @ 0x9B)
//------------------------------------------------------------------------------
#define CAN0BTH_TSEG1__FMASK 0x0F ///< Timing Segment 1
#define CAN0BTH_TSEG1__SHIFT 0x00 ///< Timing Segment 1
                                                       
#define CAN0BTH_TSEG2__FMASK 0x70 ///< Timing Segment 2
#define CAN0BTH_TSEG2__SHIFT 0x04 ///< Timing Segment 2
                                                       
//------------------------------------------------------------------------------
// CAN0BTL Enums (CAN Bit Timing Low @ 0x9A)
//------------------------------------------------------------------------------
#define CAN0BTL_BRP__FMASK 0x3F ///< Baud Rate Prescaler       
#define CAN0BTL_BRP__SHIFT 0x00 ///< Baud Rate Prescaler       
                                                               
#define CAN0BTL_SJW__FMASK 0xC0 ///< Synchronization Jump Width
#define CAN0BTL_SJW__SHIFT 0x06 ///< Synchronization Jump Width
                                                               
//------------------------------------------------------------------------------
// CAN0CFG Enums (CAN Clock Configuration @ 0x92)
//------------------------------------------------------------------------------
#define CAN0CFG_SYSDIV__FMASK        0x03 ///< CAN System Clock Divider           
#define CAN0CFG_SYSDIV__SHIFT        0x00 ///< CAN System Clock Divider           
#define CAN0CFG_SYSDIV__SYSCLK       0x00 ///< CAN controller clock is SYSCLK.    
#define CAN0CFG_SYSDIV__SYSCLK_DIV_2 0x01 ///< CAN controller clock is SYSCLK / 2.
#define CAN0CFG_SYSDIV__SYSCLK_DIV_4 0x02 ///< CAN controller clock is SYSCLK / 4.
#define CAN0CFG_SYSDIV__SYSCLK_DIV_8 0x03 ///< CAN controller clock is SYSCLK / 8.
                                                                                  
//------------------------------------------------------------------------------
// CAN0CN Enums (CAN Control @ 0xC0)
//------------------------------------------------------------------------------
#define CAN0CN_INIT__BMASK                     0x01 ///< Initialization Start                              
#define CAN0CN_INIT__SHIFT                     0x00 ///< Initialization Start                              
#define CAN0CN_INIT__NORMAL                    0x00 ///< Normal operation.                                 
#define CAN0CN_INIT__STARTED                   0x01 ///< Initialization is started.                        
                                                                                                           
#define CAN0CN_IE__BMASK                       0x02 ///< Interrupt Enable                                  
#define CAN0CN_IE__SHIFT                       0x01 ///< Interrupt Enable                                  
#define CAN0CN_IE__INT_DISABLED                0x00 ///< Disabled - Module interrupt interrupt request     
                                                    ///< (IRQB) is always high.                            
#define CAN0CN_IE__INT_ENABLED                 0x02 ///< Enabled - Interrupts will set IRQB to low. IRQB   
                                                    ///< remains low until all pending interrupts are      
                                                    ///< processed.                                        
                                                                                                           
