ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define CAN0IF1A2H_DIR__BMASK      0x20 ///< Message Direction                                
#define CAN0IF1A2H_DIR__SHIFT      0x05 ///< Message Direction                                
#define CAN0IF1A2H_DIR__RECEIVE    0x00 ///< Direction = receive. On TXRQST, a remote frame   
                                        ///< with the identifier of this message object is    
                                        ///< transmitted. On reception of a data frame with   
                                        ///< matching identifier, that message is stored in   
                                        ///< this message object.                             
#define CAN0IF1A2H_DIR__TRANSMIT   0x20 ///< Direction = transmit. On TXRQST, the respective  
                                        ///< message object is transmitted as a data frame. On
                                        ///< reception of a remote frame with matching        
                                        ///< identifier, the TXRQST bit of this message object
                                        ///< is set if RMTEN is set to 1.                     
                                                                                              
#define CAN0IF1A2H_XTD__BMASK      0x40 ///< Extended Identifier Select                       
#define CAN0IF1A2H_XTD__SHIFT      0x06 ///< Extended Identifier Select                       
#define CAN0IF1A2H_XTD__STANDARD   0x00 ///< The 11-bit standard identifier will be used for  
                                        ///< this message object.                             
#define CAN0IF1A2H_XTD__EXTENDED   0x40 ///< The 29-bit extended identifier will be used for  
                                        ///< this message object.                             
                                                                                              
#define CAN0IF1A2H_MSGVAL__BMASK   0x80 ///< Message Valid Flag                               
#define CAN0IF1A2H_MSGVAL__SHIFT   0x07 ///< Message Valid Flag                               
#define CAN0IF1A2H_MSGVAL__NOT_SET 0x00 ///< The message object is ignored by the message     
                                        ///< handler.                                         
#define CAN0IF1A2H_MSGVAL__SET     0x80 ///< The message object is configured and should be   
                                        ///< considered by the message handler.               
                                                                                              
//------------------------------------------------------------------------------
// CAN0IF1A2L Enums (CAN Interface 1 Arbitration 2 Low @ 0xCC)
//------------------------------------------------------------------------------
#define CAN0IF1A2L_ID__FMASK 0xFF ///< Interface 1 Message Identifier
#define CAN0IF1A2L_ID__SHIFT 0x00 ///< Interface 1 Message Identifier
                                                                     
//------------------------------------------------------------------------------
// CAN0IF1CMH Enums (CAN Interface 1 Command Mask High @ 0xC3)
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
// CAN0IF1CML Enums (CAN Interface 1 Command Mask Low @ 0xC2)
//------------------------------------------------------------------------------
#define CAN0IF1CML_DATAB__BMASK             0x01 ///< Access Data Bytes 4-7                             
#define CAN0IF1CML_DATAB__SHIFT             0x00 ///< Access Data Bytes 4-7                             
#define CAN0IF1CML_DATAB__DO_NOT_TRANSFER   0x00 ///< Data bytes 4-7 are unchanged.                     
#define CAN0IF1CML_DATAB__TRANSFER          0x01 ///< On a write, transfer data bytes 4-7 to the message
                                                 ///< object. On a read, transfer data bytes 4-7 to the 
                                                 ///< IFx message buffer register.                      
                                                                                                        
#define CAN0IF1CML_DATAA__BMASK             0x02 ///< Access Data Bytes 0-3                             
#define CAN0IF1CML_DATAA__SHIFT             0x01 ///< Access Data Bytes 0-3                             
#define CAN0IF1CML_DATAA__DO_NOT_TRANSFER   0x00 ///< Data bytes 0-3 are unchanged.                     
#define CAN0IF1CML_DATAA__TRANSFER          0x02 ///< On a write, transfer data bytes 0-3 to the message
                                                 ///< object. On a read, transfer data bytes 0-3 to the 
                                                 ///< IFx message buffer register.                      
                                                                                                        
#define CAN0IF1CML_TXRND__BMASK             0x04 ///< Access Transmission Request                       
#define CAN0IF1CML_TXRND__SHIFT             0x02 ///< Access Transmission Request                       
#define CAN0IF1CML_TXRND__DO_NOT_CHANGE     0x00 ///< On a write, the TXRQST bit is unchanged. On a     
                                                 ///< read, the NEWDAT bit remains unchanged.           
#define CAN0IF1CML_TXRND__SET_OR_CLEAR      0x04 ///< On a write, set the TXRQST bit. On a read, clear  
                                                 ///< the NEWDAT bit in the message object.             
                                                                                                        
#define CAN0IF1CML_CLRINTPND__BMASK         0x08 ///< Clear Interrupt Pending                           
#define CAN0IF1CML_CLRINTPND__SHIFT         0x03 ///< Clear Interrupt Pending                           
#define CAN0IF1CML_CLRINTPND__DO_NOT_CLEAR  0x00 ///< The INTPND bit remains unchanged.                 
#define CAN0IF1CML_CLRINTPND__CLEAR         0x08 ///< Clear the INTPND bit in the message object.       
                                                                                                        
#define CAN0IF1CML_CONTROL__BMASK           0x10 ///< Access Control                                    
#define CAN0IF1CML_CONTROL__SHIFT           0x04 ///< Access Control                                    
#define CAN0IF1CML_CONTROL__DO_NOT_TRANSFER 0x00 ///< Do not transfer the control bits.                 
#define CAN0IF1CML_CONTROL__TRANSFER        0x10 ///< On a write, transfer the control bits to the      
                                                 ///< message object. On a read, transfer the control   
                                                 ///< bits to the IFx message buffer register.          
                                                                                                        
#define CAN0IF1CML_ARB__BMASK               0x20 ///< Access Arbitration                                
#define CAN0IF1CML_ARB__SHIFT               0x05 ///< Access Arbitration                                
#define CAN0IF1CML_ARB__DO_NOT_TRANSFER     0x00 ///< Do not transfer the arbitration bits.             
#define CAN0IF1CML_ARB__TRANSFER            0x20 ///< On a write, transfer the identifier + DIR + XTD + 
                                                 ///< MSGVAL to the message object. On a read, transfer 
                                                 ///< the identifier + DIR + XTD+ MSGVAL to the IFx     
                                                 ///< message buffer register.                          
                                                                                                        
#define CAN0IF1CML_MASK__BMASK              0x40 ///< Access Mask                                       
#define CAN0IF1CML_MASK__SHIFT              0x06 ///< Access Mask                                       
#define CAN0IF1CML_MASK__DO_NOT_TRANSFER    0x00 ///< Do not transfer the mask bits.                    
#define CAN0IF1CML_MASK__TRANSFER           0x40 ///< On a write, transfer the identifier mask + MDIR + 
                                                 ///< MXTD to the message object. On a read, transfer   
                                                 ///< the identifier mask + MDIR + MXTD to the IFx      
                                                 ///< message buffer register.                          
                                                                                                        
#define CAN0IF1CML_WRRD__BMASK              0x80 ///< Write / Read Direction Control                    
#define CAN0IF1CML_WRRD__SHIFT              0x07 ///< Write / Read Direction Control                    
#define CAN0IF1CML_WRRD__READ               0x00 ///< Read: transfer data from the message object       
                                                 ///< addressed by the command request register into the
                                                 ///< selected message buffer registers.                
#define CAN0IF1CML_WRRD__WRITE              0x80 ///< Write: transfer data from the selected message    
                                                 ///< buffer registers to the message object addressed  
                                                 ///< by the command request register.                  
                                                                                                        
//------------------------------------------------------------------------------
// CAN0IF1CRH Enums (CAN Interface 1 Command Request High @ 0xBF)
//------------------------------------------------------------------------------
#define CAN0IF1CRH_BUSY__BMASK   0x80 ///< Busy Flag                                       
#define CAN0IF1CRH_BUSY__SHIFT   0x07 ///< Busy Flag                                       
#define CAN0IF1CRH_BUSY__NOT_SET 0x00 ///< Set to 1 when writing to the IFx command request
                                      ///< register.                                       
#define CAN0IF1CRH_BUSY__SET     0x80 ///< Reset to 0 when the read or write action has    
                                      ///< finished.                                       
                                                                                           
//------------------------------------------------------------------------------
// CAN0IF1CRL Enums (CAN Interface 1 Command Request Low @ 0xBE)
//------------------------------------------------------------------------------
#define CAN0IF1CRL_MSGNUM__FMASK 0x3F ///< Message Number
#define CAN0IF1CRL_MSGNUM__SHIFT 0x00 ///< Message Number
                                                         
//------------------------------------------------------------------------------
// CAN0IF1DA1H Enums (CAN Interface 1 Data A 1 High @ 0xD5)
//------------------------------------------------------------------------------
#define CAN0IF1DA1H_DATA1__FMASK 0xFF ///< Interface 1 Data 1
#define CAN0IF1DA1H_DATA1__SHIFT 0x00 ///< Interface 1 Data 1
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DA1L Enums (CAN Interface 1 Data A 1 Low @ 0xD4)
//------------------------------------------------------------------------------
#define CAN0IF1DA1L_DATA0__FMASK 0xFF ///< Interface 1 Data 0
#define CAN0IF1DA1L_DATA0__SHIFT 0x00 ///< Interface 1 Data 0
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DA2H Enums (CAN Interface 1 Data A 2 High @ 0xD7)
//------------------------------------------------------------------------------
#define CAN0IF1DA2H_DATA3__FMASK 0xFF ///< Interface 1 Data 3
#define CAN0IF1DA2H_DATA3__SHIFT 0x00 ///< Interface 1 Data 3
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DA2L Enums (CAN Interface 1 Data A 2 Low @ 0xD6)
//------------------------------------------------------------------------------
#define CAN0IF1DA2L_DATA2__FMASK 0xFF ///< Interface 1 Data 2
#define CAN0IF1DA2L_DATA2__SHIFT 0x00 ///< Interface 1 Data 2
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DB1H Enums (CAN Interface 1 Data B 1 High @ 0xDB)
//------------------------------------------------------------------------------
#define CAN0IF1DB1H_DATA5__FMASK 0xFF ///< Interface 1 Data 5
#define CAN0IF1DB1H_DATA5__SHIFT 0x00 ///< Interface 1 Data 5
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DB1L Enums (CAN Interface 1 Data B 1 Low @ 0xDA)
//------------------------------------------------------------------------------
#define CAN0IF1DB1L_DATA4__FMASK 0xFF ///< Interface 1 Data 4
#define CAN0IF1DB1L_DATA4__SHIFT 0x00 ///< Interface 1 Data 4
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DB2H Enums (CAN Interface 1 Data B 2 High @ 0xDD)
//------------------------------------------------------------------------------
#define CAN0IF1DB2H_DATA7__FMASK 0xFF ///< Interface 1 Data 7
#define CAN0IF1DB2H_DATA7__SHIFT 0x00 ///< Interface 1 Data 7
                                                             
//------------------------------------------------------------------------------
// CAN0IF1DB2L Enums (CAN Interface 1 Data B 2 Low @ 0xDC)
//------------------------------------------------------------------------------
#define CAN0IF1DB2L_DATA6__FMASK 0xFF ///< Interface 1 Data 6
#define CAN0IF1DB2L_DATA6__SHIFT 0x00 ///< Interface 1 Data 6
                                                             
//------------------------------------------------------------------------------
// CAN0IF1M1H Enums (CAN Interface 1 Mask 1 High @ 0xC5)
//------------------------------------------------------------------------------
#define CAN0IF1M1H_MSK__FMASK 0xFF ///< Interface 1 Identifier Mask
#define CAN0IF1M1H_MSK__SHIFT 0x00 ///< Interface 1 Identifier Mask
                                                                   
//------------------------------------------------------------------------------
// CAN0IF1M1L Enums (CAN Interface 1 Mask 1 Low @ 0xC4)
//------------------------------------------------------------------------------
#define CAN0IF1M1L_MSK__FMASK 0xFF ///< Interface 1 Identifier Mask
#define CAN0IF1M1L_MSK__SHIFT 0x00 ///< Interface 1 Identifier Mask
                                                                   
//------------------------------------------------------------------------------
// CAN0IF1M2H Enums (CAN Interface 1 Mask 2 High @ 0xC7)
//------------------------------------------------------------------------------
#define CAN0IF1M2H_MSK__FMASK     0x1F ///< Interface 1 Identifier Mask                       
#define CAN0IF1M2H_MSK__SHIFT     0x00 ///< Interface 1 Identifier Mask                       
                                                                                              
#define CAN0IF1M2H_MDIR__BMASK    0x40 ///< Mask Message Direction                            
#define CAN0IF1M2H_MDIR__SHIFT    0x06 ///< Mask Message Direction                            
#define CAN0IF1M2H_MDIR__DISABLED 0x00 ///< The message direction bit (DIR) has no effect on  
                                       ///< the acceptance filtering.                         
#define CAN0IF1M2H_MDIR__ENABLED  0x40 ///< The message direction bit (DIR) is used for       
                                       ///< acceptance filtering.                             
                                                                                              
#define CAN0IF1M2H_MXTD__BMASK    0x80 ///< Mask Extended Identifier                          
#define CAN0IF1M2H_MXTD__SHIFT    0x07 ///< Mask Extended Identifier                          
#define CAN0IF1M2H_MXTD__DISABLED 0x00 ///< The extended identifier bit (IDE) has no effect on
                                       ///< the acceptance filtering.                         
#define CAN0IF1M2H_MXTD__ENABLED  0x80 ///< The extended identifier bit (IDE) is used for     
                                       ///< acceptance filtering.                             
                                                                                              
//------------------------------------------------------------------------------
// CAN0IF1M2L Enums (CAN Interface 1 Mask 2 Low @ 0xC6)
//------------------------------------------------------------------------------
#define CAN0IF1M2L_MSK__FMASK 0xFF ///< Interface 1 Identifier Mask
#define CAN0IF1M2L_MSK__SHIFT 0x00 ///< Interface 1 Identifier Mask
                                                                   
//------------------------------------------------------------------------------
// CAN0IF1MCH Enums (CAN Interface 1 Message Control High @ 0xD3)
//------------------------------------------------------------------------------
#define CAN0IF1MCH_TXRQST__BMASK   0x01 ///< Transmit Request Flag                             
#define CAN0IF1MCH_TXRQST__SHIFT   0x00 ///< Transmit Request Flag                             
#define CAN0IF1MCH_TXRQST__NOT_SET 0x00 ///< The message object is not waiting for             
                                        ///< transmission.                                     
#define CAN0IF1MCH_TXRQST__SET     0x01 ///< The transmission of this message object is        
                                        ///< requested and is not yet done.                    
                                                                                               
#define CAN0IF1MCH_RMTEN__BMASK    0x02 ///< Remote Enable                                     
#define CAN0IF1MCH_RMTEN__SHIFT    0x01 ///< Remote Enable                                     
#define CAN0IF1MCH_RMTEN__DISABLED 0x00 ///< At the reception of a remote frame, TXRQST is left
                                        ///< unchanged.                                        
#define CAN0IF1MCH_RMTEN__ENABLED  0x02 ///< At the reception of a remote frame, TXRQST is set 
                                        ///< to 1.                                             
                                                                                               
#define CAN0IF1MCH_RXIE__BMASK     0x04 ///< Receive Interrupt Enable                          
#define CAN0IF1MCH_RXIE__SHIFT     0x02 ///< Receive Interrupt Enable                          
#define CAN0IF1MCH_RXIE__DISABLED  0x00 ///< INTPND will be left unchanged after the successful
                                        ///< reception of a frame.                             
#define CAN0IF1MCH_RXIE__ENABLED   0x04 ///< INTPND will be set after a successful reception of
                                        ///< a frame.                                          
                                                                                               
#define CAN0IF1MCH_TXIE__BMASK     0x08 ///< Transmit Interrupt Enable                         
#define CAN0IF1MCH_TXIE__SHIFT     0x03 ///< Transmit Interrupt Enable                         
#define CAN0IF1MCH_TXIE__DISABLED  0x00 ///< INTPND will be left unchanged after the successful
                                        ///< transmission of a frame.                          
#define CAN0IF1MCH_TXIE__ENABLED   0x08 ///< INTPND will be set after a successful transmission
                                        ///< of a frame.                                       
                                                                                               
#define CAN0IF1MCH_UMASK__BMASK    0x10 ///< Use Acceptance Mask                               
#define CAN0IF1MCH_UMASK__SHIFT    0x04 ///< Use Acceptance Mask                               
#define CAN0IF1MCH_UMASK__DISABLED 0x00 ///< Mask ignored.                                     
#define CAN0IF1MCH_UMASK__ENABLED  0x10 ///< Use the mask (MSK, MXTD, and MDIR) for acceptance 
                                        ///< filtering.                                        
                                                                                               
#define CAN0IF1MCH_INTPND__BMASK   0x20 ///< Interrupt Pending Flag                            
#define CAN0IF1MCH_INTPND__SHIFT   0x05 ///< Interrupt Pending Flag                            
#define CAN0IF1MCH_INTPND__NOT_SET 0x00 ///< This message object is not the source of an       
                                        ///< interrupt.                                        
#define CAN0IF1MCH_INTPND__SET     0x20 ///< This message object is the source of an interrupt.
                                        ///< The interrupt identifier in the interrupt register
                                        ///< will point to this message object if there is no  
                                        ///< other interrupt source with higher priority.      
                                                                                               
