ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define CPT2CN_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CPT2CN_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CPT2CN_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                ///< flag was last cleared.                            
#define CPT2CN_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                       
#define CPT2CN_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CPT2CN_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CPT2CN_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP2P < CP2N.                           
#define CPT2CN_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP2P > CP2N.                           
                                                                                                       
#define CPT2CN_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CPT2CN_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CPT2CN_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CPT2CN_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                       
//------------------------------------------------------------------------------
// CPT2MD Enums (Comparator 2 Mode @ 0x9B)
//------------------------------------------------------------------------------
#define CPT2MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CPT2MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CPT2MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CPT2MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CPT2MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CPT2MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CPT2MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT2MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT2MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CPT2MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CPT2MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT2MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT2MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CPT2MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
//------------------------------------------------------------------------------
// CPT2MX Enums (Comparator 2 Multiplexer Selection @ 0x9C)
//------------------------------------------------------------------------------
#define CPT2MX_CMXP__FMASK   0x0F ///< Comparator Positive Input MUX Selection
#define CPT2MX_CMXP__SHIFT   0x00 ///< Comparator Positive Input MUX Selection
#define CPT2MX_CMXP__CMP2P0  0x00 ///< External pin CMP2P.0.                  
#define CPT2MX_CMXP__CMP2P1  0x01 ///< External pin CMP2P.1.                  
#define CPT2MX_CMXP__CMP2P2  0x02 ///< External pin CMP2P.2.                  
#define CPT2MX_CMXP__CMP2P3  0x03 ///< External pin CMP2P.3.                  
#define CPT2MX_CMXP__CMP2P4  0x04 ///< External pin CMP2P.4.                  
#define CPT2MX_CMXP__CMP2P5  0x05 ///< External pin CMP2P.5.                  
#define CPT2MX_CMXP__CMP2P6  0x06 ///< External pin CMP2P.6.                  
#define CPT2MX_CMXP__CMP2P7  0x07 ///< External pin CMP2P.7.                  
#define CPT2MX_CMXP__CMP2P8  0x08 ///< External pin CMP2P.8.                  
#define CPT2MX_CMXP__CMP2P9  0x09 ///< External pin CMP2P.9.                  
#define CPT2MX_CMXP__CMP2P10 0x0A ///< External pin CMP2P.10.                 
#define CPT2MX_CMXP__CMP2P11 0x0B ///< External pin CMP2P.11.                 
#define CPT2MX_CMXP__NONE    0x0F ///< No input selected.                     
                                                                              
#define CPT2MX_CMXN__FMASK   0xF0 ///< Comparator Negative Input MUX Selection
#define CPT2MX_CMXN__SHIFT   0x04 ///< Comparator Negative Input MUX Selection
#define CPT2MX_CMXN__CMP2N0  0x00 ///< External pin CMP2N.0.                  
#define CPT2MX_CMXN__CMP2N1  0x10 ///< External pin CMP2N.1.                  
#define CPT2MX_CMXN__CMP2N2  0x20 ///< External pin CMP2N.2.                  
#define CPT2MX_CMXN__CMP2N3  0x30 ///< External pin CMP2N.3.                  
#define CPT2MX_CMXN__CMP2N4  0x40 ///< External pin CMP2N.4.                  
#define CPT2MX_CMXN__CMP2N5  0x50 ///< External pin CMP2N.5.                  
#define CPT2MX_CMXN__CMP2N6  0x60 ///< External pin CMP2N.6.                  
#define CPT2MX_CMXN__CMP2N7  0x70 ///< External pin CMP2N.7.                  
#define CPT2MX_CMXN__CMP2N8  0x80 ///< External pin CMP2N.8.                  
#define CPT2MX_CMXN__CMP2N9  0x90 ///< External pin CMP2N.9.                  
#define CPT2MX_CMXN__CMP2N10 0xA0 ///< External pin CMP2N.10.                 
#define CPT2MX_CMXN__CMP2N11 0xB0 ///< External pin CMP2N.11.                 
#define CPT2MX_CMXN__NONE    0xF0 ///< No input selected.                     
                                                                              
//------------------------------------------------------------------------------
// SN0 Enums (Serial Number Byte 0 @ 0xF9)
//------------------------------------------------------------------------------
#define SN0_SERNUM0__FMASK 0xFF ///< Serial Number Byte 0
#define SN0_SERNUM0__SHIFT 0x00 ///< Serial Number Byte 0
                                                         
//------------------------------------------------------------------------------
// SN1 Enums (Serial Number Byte 1 @ 0xFA)
//------------------------------------------------------------------------------
#define SN1_SERNUM1__FMASK 0xFF ///< Serial Number Byte 1
#define SN1_SERNUM1__SHIFT 0x00 ///< Serial Number Byte 1
                                                         
//------------------------------------------------------------------------------
// SN2 Enums (Serial Number Byte 2 @ 0xFB)
//------------------------------------------------------------------------------
#define SN2_SERNUM2__FMASK 0xFF ///< Serial Number Byte 2
#define SN2_SERNUM2__SHIFT 0x00 ///< Serial Number Byte 2
                                                         
//------------------------------------------------------------------------------
// SN3 Enums (Serial Number Byte 3 @ 0xFC)
//------------------------------------------------------------------------------
#define SN3_SERNUM3__FMASK 0xFF ///< Serial Number Byte 3
#define SN3_SERNUM3__SHIFT 0x00 ///< Serial Number Byte 3
                                                         
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P1_0        0x00 ///< Select P1.0.              
#define IT01CF_IN0SL__P1_1        0x01 ///< Select P1.1.              
#define IT01CF_IN0SL__P1_2        0x02 ///< Select P1.2.              
#define IT01CF_IN0SL__P1_3        0x03 ///< Select P1.3.              
#define IT01CF_IN0SL__P1_4        0x04 ///< Select P1.4.              
#define IT01CF_IN0SL__P1_5        0x05 ///< Select P1.5.              
#define IT01CF_IN0SL__P1_6        0x06 ///< Select P1.6.              
#define IT01CF_IN0SL__P1_7        0x07 ///< Select P1.7.              
                                                                      
