ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define EIE1_EPCA0__BMASK     0x08 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x03 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x08 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_ECP0__BMASK      0x10 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__SHIFT      0x04 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__DISABLED   0x00 ///< Disable CP0 interrupts.                           
#define EIE1_ECP0__ENABLED    0x10 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF or CPFIF flags.                
                                                                                          
#define EIE1_ECP1__BMASK      0x20 ///< Comparator1 (CP1) Interrupt Enable                
#define EIE1_ECP1__SHIFT      0x05 ///< Comparator1 (CP1) Interrupt Enable                
#define EIE1_ECP1__DISABLED   0x00 ///< Disable CP1 interrupts.                           
#define EIE1_ECP1__ENABLED    0x20 ///< Enable interrupt requests generated by the        
                                   ///< comparator 1 CPRIF or CPFIF flags.                
                                                                                          
#define EIE1_ET3__BMASK       0x40 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x06 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x40 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
#define EIE1_ELIN0__BMASK     0x80 ///< LIN0 Interrupt Enable                             
#define EIE1_ELIN0__SHIFT     0x07 ///< LIN0 Interrupt Enable                             
#define EIE1_ELIN0__DISABLED  0x00 ///< Disable LIN0 interrupts.                          
#define EIE1_ELIN0__ENABLED   0x80 ///< Enable interrupt requests generated by LIN0.      
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xE7)
//------------------------------------------------------------------------------
#define EIE2_EREG0__BMASK    0x01 ///< Voltage Regulator Interrupt Enable                
#define EIE2_EREG0__SHIFT    0x00 ///< Voltage Regulator Interrupt Enable                
#define EIE2_EREG0__DISABLED 0x00 ///< Disable the voltage regulator dropout interrupt.  
#define EIE2_EREG0__ENABLED  0x01 ///< Enable the voltage regulator dropout interrupt.   
                                                                                         
#define EIE2_ECAN0__BMASK    0x02 ///< CAN0 Interrupt Enable                             
#define EIE2_ECAN0__SHIFT    0x01 ///< CAN0 Interrupt Enable                             
#define EIE2_ECAN0__DISABLED 0x00 ///< Disable CAN0 interrupts.                          
#define EIE2_ECAN0__ENABLED  0x02 ///< Enable interrupt requests generated by CAN0.      
                                                                                         
#define EIE2_EMAT__BMASK     0x04 ///< Port Match Interrupts Enable                      
#define EIE2_EMAT__SHIFT     0x02 ///< Port Match Interrupts Enable                      
#define EIE2_EMAT__DISABLED  0x00 ///< Disable all Port Match interrupts.                
#define EIE2_EMAT__ENABLED   0x04 ///< Enable interrupt requests generated by a Port     
                                  ///< Match.                                            
                                                                                         
#define EIE2_ES1__BMASK      0x08 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__SHIFT      0x03 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__DISABLED   0x00 ///< Disable UART1 interrupt.                          
#define EIE2_ES1__ENABLED    0x08 ///< Enable UART1 interrupt.                           
                                                                                         
#define EIE2_EPCA1__BMASK    0x10 ///< Programmable Counter Array (PCA1) Interrupt Enable
#define EIE2_EPCA1__SHIFT    0x04 ///< Programmable Counter Array (PCA1) Interrupt Enable
#define EIE2_EPCA1__DISABLED 0x00 ///< Disable all PCA1 interrupts.                      
#define EIE2_EPCA1__ENABLED  0x10 ///< Enable interrupt requests generated by PCA1.      
                                                                                         
#define EIE2_ECP2__BMASK     0x20 ///< Comparator2 (CP2) Interrupt Enable                
#define EIE2_ECP2__SHIFT     0x05 ///< Comparator2 (CP2) Interrupt Enable                
#define EIE2_ECP2__DISABLED  0x00 ///< Disable CP2 interrupts.                           
#define EIE2_ECP2__ENABLED   0x20 ///< Enable interrupt requests generated by the        
                                  ///< comparator 2 CPRIF or CPFIF flags.                
                                                                                         
#define EIE2_ET4__BMASK      0x40 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__SHIFT      0x06 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__DISABLED   0x00 ///< Disable Timer 4 interrupt.                        
#define EIE2_ET4__ENABLED    0x40 ///< Enable interrupt requests generated by the TF4L or
                                  ///< TF4H flags.                                       
                                                                                         
#define EIE2_ET5__BMASK      0x80 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__SHIFT      0x07 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__DISABLED   0x00 ///< Disable Timer 5 interrupt.                        
#define EIE2_ET5__ENABLED    0x80 ///< Enable interrupt requests generated by the TF5L or
                                  ///< TF5H flags.                                       
                                                                                         
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt set to low priority level.                   
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt set to high priority level.                  
                                                                                                 
