ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define EIP1_PWADC0__BMASK 0x02 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__SHIFT 0x01 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt set to low priority level.            
#define EIP1_PWADC0__HIGH  0x02 ///< ADC0 Window interrupt set to high priority level.           
                                                                                                 
#define EIP1_PADC0__BMASK  0x04 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__SHIFT  0x02 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt set to low               
                                ///< priority level.                                             
#define EIP1_PADC0__HIGH   0x04 ///< ADC0 Conversion Complete interrupt set to high              
                                ///< priority level.                                             
                                                                                                 
#define EIP1_PPCA0__BMASK  0x08 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__SHIFT  0x03 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt set to low priority level.                   
#define EIP1_PPCA0__HIGH   0x08 ///< PCA0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PCP0__BMASK   0x10 ///< Comparator0 (CP0) Interrupt Priority Control                
#define EIP1_PCP0__SHIFT   0x04 ///< Comparator0 (CP0) Interrupt Priority Control                
#define EIP1_PCP0__LOW     0x00 ///< CP0 interrupt set to low priority level.                    
#define EIP1_PCP0__HIGH    0x10 ///< CP0 interrupt set to high priority level.                   
                                                                                                 
#define EIP1_PCP1__BMASK   0x20 ///< Comparator1 (CP1) Interrupt Priority Control                
#define EIP1_PCP1__SHIFT   0x05 ///< Comparator1 (CP1) Interrupt Priority Control                
#define EIP1_PCP1__LOW     0x00 ///< CP1 interrupt set to low priority level.                    
#define EIP1_PCP1__HIGH    0x20 ///< CP1 interrupt set to high priority level.                   
                                                                                                 
#define EIP1_PT3__BMASK    0x40 ///< Timer 3 Interrupt Priority Control                          
#define EIP1_PT3__SHIFT    0x06 ///< Timer 3 Interrupt Priority Control                          
#define EIP1_PT3__LOW      0x00 ///< Timer 3 interrupts set to low priority level.               
#define EIP1_PT3__HIGH     0x40 ///< Timer 3 interrupts set to high priority level.              
                                                                                                 
#define EIP1_PLIN0__BMASK  0x80 ///< LIN0 Interrupt Priority Control                             
#define EIP1_PLIN0__SHIFT  0x07 ///< LIN0 Interrupt Priority Control                             
#define EIP1_PLIN0__LOW    0x00 ///< LIN0 interrupts set to low priority level.                  
#define EIP1_PLIN0__HIGH   0x80 ///< LIN0 interrupts set to high priority level.                 
                                                                                                 
//------------------------------------------------------------------------------
// EIP2 Enums (Extended Interrupt Priority 2 @ 0xF7)
//------------------------------------------------------------------------------
#define EIP2_PREG0__BMASK 0x01 ///< Voltage Regulator Interrupt Priority Control                
#define EIP2_PREG0__SHIFT 0x00 ///< Voltage Regulator Interrupt Priority Control                
#define EIP2_PREG0__LOW   0x00 ///< Voltage regulator dropout interrupts set to low             
                               ///< priority level.                                             
#define EIP2_PREG0__HIGH  0x01 ///< Voltage regulator dropout interrupts set to high            
                               ///< priority level.                                             
                                                                                                
#define EIP2_PCAN0__BMASK 0x02 ///< CAN0 Interrupt Priority Control                             
#define EIP2_PCAN0__SHIFT 0x01 ///< CAN0 Interrupt Priority Control                             
#define EIP2_PCAN0__LOW   0x00 ///< CAN0 interrupts set to low priority level.                  
#define EIP2_PCAN0__HIGH  0x02 ///< CAN0 interrupts set to high priority level.                 
                                                                                                
#define EIP2_PMAT__BMASK  0x04 ///< Port Match Interrupt Priority Control                       
#define EIP2_PMAT__SHIFT  0x02 ///< Port Match Interrupt Priority Control                       
#define EIP2_PMAT__LOW    0x00 ///< Port Match interrupt set to low priority level.             
#define EIP2_PMAT__HIGH   0x04 ///< Port Match interrupt set to high priority level.            
                                                                                                
#define EIP2_PS1__BMASK   0x08 ///< UART1 Interrupt Priority Control                            
#define EIP2_PS1__SHIFT   0x03 ///< UART1 Interrupt Priority Control                            
#define EIP2_PS1__LOW     0x00 ///< UART1 interrupt set to low priority level.                  
#define EIP2_PS1__HIGH    0x08 ///< UART1 interrupt set to high priority level.                 
                                                                                                
#define EIP2_PPCA1__BMASK 0x10 ///< Programmable Counter Array (PCA1) Interrupt Priority Control
#define EIP2_PPCA1__SHIFT 0x04 ///< Programmable Counter Array (PCA1) Interrupt Priority Control
#define EIP2_PPCA1__LOW   0x00 ///< PCA1 interrupt set to low priority level.                   
#define EIP2_PPCA1__HIGH  0x10 ///< PCA1 interrupt set to high priority level.                  
                                                                                                
