ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define LIN0CTRL_TXRX__BMASK    0x20 ///< Transmit/Receive Selection                        
#define LIN0CTRL_TXRX__SHIFT    0x05 ///< Transmit/Receive Selection                        
#define LIN0CTRL_TXRX__RECEIVE  0x00 ///< The current frame is a receive operation.         
#define LIN0CTRL_TXRX__TRANSMIT 0x20 ///< The current frame is a transmit operation.        
                                                                                            
#define LIN0CTRL_SLEEP__BMASK   0x40 ///< Sleep Mode Warning                                
#define LIN0CTRL_SLEEP__SHIFT   0x06 ///< Sleep Mode Warning                                
#define LIN0CTRL_SLEEP__CLEAR   0x00 ///< Clear the sleep mode warning.                     
#define LIN0CTRL_SLEEP__WARN    0x40 ///< A sleep mode frame or bus idle timeout was        
                                     ///< received.                                         
                                                                                            
#define LIN0CTRL_STOP__BMASK    0x80 ///< Stop Communication Processing                     
#define LIN0CTRL_STOP__SHIFT    0x07 ///< Stop Communication Processing                     
#define LIN0CTRL_STOP__STOP     0x80 ///< Block the processing of the LIN0 communications   
                                     ///< until the next SYNCH BREAK.                       
                                                                                            
//------------------------------------------------------------------------------
// LIN0DAT Enums (LIN0 Indirect Data @ 0xD2)
//------------------------------------------------------------------------------
#define LIN0DAT_LINDATA__FMASK 0xFF ///< Indirect Data
#define LIN0DAT_LINDATA__SHIFT 0x00 ///< Indirect Data
                                                      
//------------------------------------------------------------------------------
// LIN0DIV Enums (LIN0 Divider @ 0x0C)
//------------------------------------------------------------------------------
#define LIN0DIV_LINDIV__FMASK 0xFF ///< Baud Rate Divider Low Byte
#define LIN0DIV_LINDIV__SHIFT 0x00 ///< Baud Rate Divider Low Byte
                                                                  
//------------------------------------------------------------------------------
// LIN0DT1 Enums (LIN0 Data Byte 1 @ 0x00)
//------------------------------------------------------------------------------
#define LIN0DT1_LIN0DT1__FMASK 0xFF ///< Data Byte 1
#define LIN0DT1_LIN0DT1__SHIFT 0x00 ///< Data Byte 1
                                                    
//------------------------------------------------------------------------------
// LIN0DT2 Enums (LIN0 Data Byte 2 @ 0x01)
//------------------------------------------------------------------------------
#define LIN0DT2_LIN0DT2__FMASK 0xFF ///< Data Byte 2
#define LIN0DT2_LIN0DT2__SHIFT 0x00 ///< Data Byte 2
                                                    
//------------------------------------------------------------------------------
// LIN0DT3 Enums (LIN0 Data Byte 3 @ 0x02)
//------------------------------------------------------------------------------
#define LIN0DT3_LIN0DT3__FMASK 0xFF ///< Data Byte 3
#define LIN0DT3_LIN0DT3__SHIFT 0x00 ///< Data Byte 3
                                                    
//------------------------------------------------------------------------------
// LIN0DT4 Enums (LIN0 Data Byte 4 @ 0x03)
//------------------------------------------------------------------------------
#define LIN0DT4_LIN0DT4__FMASK 0xFF ///< Data Byte 4
#define LIN0DT4_LIN0DT4__SHIFT 0x00 ///< Data Byte 4
                                                    
//------------------------------------------------------------------------------
// LIN0DT5 Enums (LIN0 Data Byte 5 @ 0x04)
//------------------------------------------------------------------------------
#define LIN0DT5_LIN0DT5__FMASK 0xFF ///< Data Byte 5
#define LIN0DT5_LIN0DT5__SHIFT 0x00 ///< Data Byte 5
                                                    
//------------------------------------------------------------------------------
// LIN0DT6 Enums (LIN0 Data Byte 6 @ 0x05)
//------------------------------------------------------------------------------
#define LIN0DT6_LIN0DT6__FMASK 0xFF ///< Data Byte 6
#define LIN0DT6_LIN0DT6__SHIFT 0x00 ///< Data Byte 6
                                                    
//------------------------------------------------------------------------------
// LIN0DT7 Enums (LIN0 Data Byte 7 @ 0x06)
//------------------------------------------------------------------------------
#define LIN0DT7_LIN0DT7__FMASK 0xFF ///< Data Byte 7
#define LIN0DT7_LIN0DT7__SHIFT 0x00 ///< Data Byte 7
                                                    
//------------------------------------------------------------------------------
// LIN0DT8 Enums (LIN0 Data Byte 8 @ 0x07)
//------------------------------------------------------------------------------
#define LIN0DT8_LIN0DT8__FMASK 0xFF ///< Data Byte 8
#define LIN0DT8_LIN0DT8__SHIFT 0x00 ///< Data Byte 8
                                                    
//------------------------------------------------------------------------------
// LIN0ERR Enums (LIN0 Error @ 0x0A)
//------------------------------------------------------------------------------
#define LIN0ERR_BITERR__BMASK   0x01 ///< Bit Transmission Error Flag                     
#define LIN0ERR_BITERR__SHIFT   0x00 ///< Bit Transmission Error Flag                     
#define LIN0ERR_BITERR__NOT_SET 0x00 ///< No error in transmission has been detected.     
#define LIN0ERR_BITERR__SET     0x01 ///< The bit value monitored during transmission is  
                                     ///< different than the bit value sent.              
                                                                                          
#define LIN0ERR_CHK__BMASK      0x02 ///< Checksum Error Flag                             
#define LIN0ERR_CHK__SHIFT      0x01 ///< Checksum Error Flag                             
#define LIN0ERR_CHK__NOT_SET    0x00 ///< Checksum error has not been detected.           
#define LIN0ERR_CHK__SET        0x02 ///< Checksum error has been detected.               
                                                                                          
