ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define XBR0_CP1E__BMASK     0x40 ///< Comparator1 Output Enable                      
#define XBR0_CP1E__SHIFT     0x06 ///< Comparator1 Output Enable                      
#define XBR0_CP1E__DISABLED  0x00 ///< CP1 unavailable at Port pin.                   
#define XBR0_CP1E__ENABLED   0x40 ///< CP1 routed to Port pin.                        
                                                                                      
#define XBR0_CP1AE__BMASK    0x80 ///< Comparator1 Asynchronous Output Enable         
#define XBR0_CP1AE__SHIFT    0x07 ///< Comparator1 Asynchronous Output Enable         
#define XBR0_CP1AE__DISABLED 0x00 ///< Asynchronous CP1 unavailable at Port pin.      
#define XBR0_CP1AE__ENABLED  0x80 ///< Asynchronous CP1 routed to Port pin.           
                                                                                      
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_SYSCKE__BMASK                         0x02 ///< SYSCLK Output Enable                             
#define XBR1_SYSCKE__SHIFT                         0x01 ///< SYSCLK Output Enable                             
#define XBR1_SYSCKE__DISABLED                      0x00 ///< SYSCLK unavailable at Port pin.                  
#define XBR1_SYSCKE__ENABLED                       0x02 ///< SYSCLK output routed to Port pin.                
                                                                                                              
#define XBR1_PCA0ME__FMASK                         0x1C ///< PCA0 Module I/O Enable                           
#define XBR1_PCA0ME__SHIFT                         0x02 ///< PCA0 Module I/O Enable                           
#define XBR1_PCA0ME__DISABLED                      0x00 ///< All PCA0 I/O unavailable at Port pins.           
#define XBR1_PCA0ME__CEX0                          0x04 ///< CEX0 routed to Port pin.                         
#define XBR1_PCA0ME__CEX0_CEX1                     0x08 ///< CEX0, CEX1 routed to Port pins.                  
#define XBR1_PCA0ME__CEX0_CEX1_CEX2                0x0C ///< CEX0, CEX1, CEX2 routed to Port pins.            
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3           0x10 ///< CEX0, CEX1, CEX2, CEX3 routed to Port pins.      
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4      0x14 ///< CEX0, CEX1, CEX2, CEX3, CEX4 routed to Port pins.
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4_CEX5 0x18 ///< CEX0, CEX1, CEX2, CEX3, CEX4, CEX5 routed to Port
                                                        ///< pins.                                            
                                                                                                              
#define XBR1_ECI0E__BMASK                          0x20 ///< PCA0 External Counter Input Enable               
#define XBR1_ECI0E__SHIFT                          0x05 ///< PCA0 External Counter Input Enable               
#define XBR1_ECI0E__DISABLED                       0x00 ///< ECI0 unavailable at Port pin.                    
#define XBR1_ECI0E__ENABLED                        0x20 ///< ECI0 routed to Port pin.                         
                                                                                                              
#define XBR1_T0E__BMASK                            0x40 ///< T0 Enable                                        
#define XBR1_T0E__SHIFT                            0x06 ///< T0 Enable                                        
#define XBR1_T0E__DISABLED                         0x00 ///< T0 unavailable at Port pin.                      
#define XBR1_T0E__ENABLED                          0x40 ///< T0 routed to Port pin.                           
                                                                                                              
#define XBR1_T1E__BMASK                            0x80 ///< T1 Enable                                        
#define XBR1_T1E__SHIFT                            0x07 ///< T1 Enable                                        
#define XBR1_T1E__DISABLED                         0x00 ///< T1 unavailable at Port pin.                      
#define XBR1_T1E__ENABLED                          0x80 ///< T1 routed to Port pin.                           
                                                                                                              
//------------------------------------------------------------------------------
// XBR2 Enums (Port I/O Crossbar 2 @ 0xC7)
//------------------------------------------------------------------------------
#define XBR2_LIN0E__BMASK               0x01 ///< LIN0 I/O Enable                                 
#define XBR2_LIN0E__SHIFT               0x00 ///< LIN0 I/O Enable                                 
#define XBR2_LIN0E__DISABLED            0x00 ///< LIN0 I/O unavailable at Port pins.              
#define XBR2_LIN0E__ENABLED             0x01 ///< LIN0 I/O routed to Port pins.                   
                                                                                                  
#define XBR2_URT1E__BMASK               0x02 ///< UART1 I/O Output Enable                         
#define XBR2_URT1E__SHIFT               0x01 ///< UART1 I/O Output Enable                         
#define XBR2_URT1E__DISABLED            0x00 ///< UART1 I/O unavailable at Port pins.             
#define XBR2_URT1E__ENABLED             0x02 ///< UART1 TX, RX routed to Port pins.               
                                                                                                  
#define XBR2_CP2E__BMASK                0x04 ///< Comparator2 Output Enable                       
#define XBR2_CP2E__SHIFT                0x02 ///< Comparator2 Output Enable                       
#define XBR2_CP2E__DISABLED             0x00 ///< CP2 unavailable at Port pin.                    
#define XBR2_CP2E__ENABLED              0x04 ///< CP2 routed to Port pin.                         
                                                                                                  
