ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define XBR2_CP2AE__BMASK               0x08 ///< Comparator2 Asynchronous Output Enable          
#define XBR2_CP2AE__SHIFT               0x03 ///< Comparator2 Asynchronous Output Enable          
#define XBR2_CP2AE__DISABLED            0x00 ///< Asynchronous CP2 unavailable at Port pin.       
#define XBR2_CP2AE__ENABLED             0x08 ///< Asynchronous CP2 routed to Port pin.            
                                                                                                  
#define XBR2_XBARE__BMASK               0x40 ///< Crossbar Enable                                 
#define XBR2_XBARE__SHIFT               0x06 ///< Crossbar Enable                                 
#define XBR2_XBARE__DISABLED            0x00 ///< Crossbar disabled.                              
#define XBR2_XBARE__ENABLED             0x40 ///< Crossbar enabled.                               
                                                                                                  
#define XBR2_WEAKPUD__BMASK             0x80 ///< Port I/O Weak Pullup Disable                    
#define XBR2_WEAKPUD__SHIFT             0x07 ///< Port I/O Weak Pullup Disable                    
#define XBR2_WEAKPUD__PULL_UPS_ENABLED  0x00 ///< Weak Pullups enabled (except for Ports whose I/O
                                             ///< are configured for analog mode).                
#define XBR2_WEAKPUD__PULL_UPS_DISABLED 0x80 ///< Weak Pullups disabled.                          
                                                                                                  
//------------------------------------------------------------------------------
// XBR3 Enums (Port I/O Crossbar 3 @ 0xC6)
//------------------------------------------------------------------------------
#define XBR3_PCA1ME__FMASK                           0x07 ///< PCA1 Module I/O Enable                            
#define XBR3_PCA1ME__SHIFT                           0x00 ///< PCA1 Module I/O Enable                            
#define XBR3_PCA1ME__DISABLED                        0x00 ///< All PCA1 I/O unavailable at Port pins.            
#define XBR3_PCA1ME__CEX6                            0x01 ///< CEX6 routed to Port pin.                          
#define XBR3_PCA1ME__CEX6_CEX7                       0x02 ///< CEX6, CEX7 routed to Port pins.                   
#define XBR3_PCA1ME__CEX6_CEX7_CEX8                  0x03 ///< CEX6, CEX7, CEX8 routed to Port pins.             
#define XBR3_PCA1ME__CEX6_CEX7_CEX8_CEX9             0x04 ///< CEX6, CEX7, CEX8, CEX9 routed to Port pins.       
#define XBR3_PCA1ME__CEX6_CEX7_CEX8_CEX9_CEX10       0x05 ///< CEX6, CEX7, CEX8, CEX9, CEX10 routed to Port pins.
#define XBR3_PCA1ME__CEX6_CEX7_CEX8_CEX9_CEX10_CEX11 0x06 ///< CEX6, CEX7, CEX8, CEX9, CEX10, CEX11 routed to    
                                                          ///< Port pins.                                        
                                                                                                                 
#define XBR3_ECI1E__BMASK                            0x08 ///< PCA1 External Counter Input Enable                
#define XBR3_ECI1E__SHIFT                            0x03 ///< PCA1 External Counter Input Enable                
#define XBR3_ECI1E__DISABLED                         0x00 ///< ECI1 unavailable at Port pin.                     
#define XBR3_ECI1E__ENABLED                          0x08 ///< ECI1 routed to Port pin.                          
                                                                                                                 
#define XBR3_T4E__BMASK                              0x10 ///< T4 Enable                                         
#define XBR3_T4E__SHIFT                              0x04 ///< T4 Enable                                         
#define XBR3_T4E__DISABLED                           0x00 ///< T4 unavailable at Port pin.                       
#define XBR3_T4E__ENABLED                            0x10 ///< T4 routed to Port pin.                            
                                                                                                                 
#define XBR3_T4EXE__BMASK                            0x20 ///< T4EX Enable                                       
#define XBR3_T4EXE__SHIFT                            0x05 ///< T4EX Enable                                       
#define XBR3_T4EXE__DISABLED                         0x00 ///< T4EX unavailable at Port pin.                     
#define XBR3_T4EXE__ENABLED                          0x20 ///< T4EX routed to Port pin.                          
                                                                                                                 
#define XBR3_T5E__BMASK                              0x40 ///< T5 Enable                                         
#define XBR3_T5E__SHIFT                              0x06 ///< T5 Enable                                         
#define XBR3_T5E__DISABLED                           0x00 ///< T5 unavailable at Port pin.                       
#define XBR3_T5E__ENABLED                            0x40 ///< T5 routed to Port pin.                            
                                                                                                                 
#define XBR3_T5EXE__BMASK                            0x80 ///< T5EX Enable                                       
#define XBR3_T5EXE__SHIFT                            0x07 ///< T5EX Enable                                       
#define XBR3_T5EXE__DISABLED                         0x00 ///< T5EX unavailable at Port pin.                     
#define XBR3_T5EXE__ENABLED                          0x80 ///< T5EX routed to Port pin.                          
                                                                                                                 
//------------------------------------------------------------------------------
// PCA0CN Enums (PCA Control @ 0xD8)
//------------------------------------------------------------------------------
#define PCA0CN_CCF0__BMASK   0x01 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN_CCF0__SHIFT   0x00 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN_CCF0__NOT_SET 0x00 ///< A match or capture did not occur on channel 0.
#define PCA0CN_CCF0__SET     0x01 ///< A match or capture occurred on channel 0.     
                                                                                     
#define PCA0CN_CCF1__BMASK   0x02 ///< PCA Module 1 Capture/Compare Flag             
#define PCA0CN_CCF1__SHIFT   0x01 ///< PCA Module 1 Capture/Compare Flag             
#define PCA0CN_CCF1__NOT_SET 0x00 ///< A match or capture did not occur on channel 1.
#define PCA0CN_CCF1__SET     0x02 ///< A match or capture occurred on channel 1.     
                                                                                     
