ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define PCA0MD_WDTE__BMASK           0x40 ///< Watchdog Timer Enable                             
#define PCA0MD_WDTE__SHIFT           0x06 ///< Watchdog Timer Enable                             
#define PCA0MD_WDTE__DISABLED        0x00 ///< Disable Watchdog Timer.                           
#define PCA0MD_WDTE__ENABLED         0x40 ///< Enable PCA Module 5 as the Watchdog Timer.        
                                                                                                 
#define PCA0MD_CIDL__BMASK           0x80 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__SHIFT           0x07 ///< PCA Counter/Timer Idle Control                    
#define PCA0MD_CIDL__NORMAL          0x00 ///< PCA continues to function normally while the      
                                          ///< system controller is in Idle Mode.                
#define PCA0MD_CIDL__SUSPEND         0x80 ///< PCA operation is suspended while the system       
                                          ///< controller is in Idle Mode.                       
                                                                                                 
//------------------------------------------------------------------------------
// PCA0PWM Enums (PCA PWM Configuration @ 0xD9)
//------------------------------------------------------------------------------
#define PCA0PWM_CLSEL__FMASK             0x03 ///< Cycle Length Select                              
#define PCA0PWM_CLSEL__SHIFT             0x00 ///< Cycle Length Select                              
#define PCA0PWM_CLSEL__8_BITS            0x00 ///< 8 bits.                                          
#define PCA0PWM_CLSEL__9_BITS            0x01 ///< 9 bits.                                          
#define PCA0PWM_CLSEL__10_BITS           0x02 ///< 10 bits.                                         
#define PCA0PWM_CLSEL__11_BITS           0x03 ///< 11 bits.                                         
                                                                                                    
#define PCA0PWM_COVF__BMASK              0x20 ///< Cycle Overflow Flag                              
#define PCA0PWM_COVF__SHIFT              0x05 ///< Cycle Overflow Flag                              
#define PCA0PWM_COVF__NO_OVERFLOW        0x00 ///< No overflow has occurred since the last time this
                                              ///< bit was cleared.                                 
#define PCA0PWM_COVF__OVERFLOW           0x20 ///< An overflow has occurred since the last time this
                                              ///< bit was cleared.                                 
                                                                                                    
#define PCA0PWM_ECOV__BMASK              0x40 ///< Cycle Overflow Interrupt Enable                  
#define PCA0PWM_ECOV__SHIFT              0x06 ///< Cycle Overflow Interrupt Enable                  
#define PCA0PWM_ECOV__COVF_MASK_DISABLED 0x00 ///< COVF will not generate PCA interrupts.           
#define PCA0PWM_ECOV__COVF_MASK_ENABLED  0x40 ///< A PCA interrupt will be generated when COVF is   
                                              ///< set.                                             
                                                                                                    
#define PCA0PWM_ARSEL__BMASK             0x80 ///< Auto-Reload Register Select                      
#define PCA0PWM_ARSEL__SHIFT             0x07 ///< Auto-Reload Register Select                      
#define PCA0PWM_ARSEL__CAPTURE_COMPARE   0x00 ///< Read/Write Capture/Compare Registers at PCA0CPHn 
                                              ///< and PCA0CPLn.                                    
#define PCA0PWM_ARSEL__AUTORELOAD        0x80 ///< Read/Write Auto-Reload Registers at PCA0CPHn and 
                                              ///< PCA0CPLn.                                        
                                                                                                    
//------------------------------------------------------------------------------
// PCA1CN Enums (PCA Control @ 0xD8)
//------------------------------------------------------------------------------
#define PCA1CN_CCF6__BMASK    0x01 ///< PCA Module 6 Capture/Compare Flag              
#define PCA1CN_CCF6__SHIFT    0x00 ///< PCA Module 6 Capture/Compare Flag              
#define PCA1CN_CCF6__NOT_SET  0x00 ///< A match or capture did not occur on Channel 6. 
#define PCA1CN_CCF6__SET      0x01 ///< A match or capture occurred on Channel 6.      
                                                                                       
#define PCA1CN_CCF7__BMASK    0x02 ///< PCA Module 7 Capture/Compare Flag              
#define PCA1CN_CCF7__SHIFT    0x01 ///< PCA Module 7 Capture/Compare Flag              
#define PCA1CN_CCF7__NOT_SET  0x00 ///< A match or capture did not occur on Channel 7. 
#define PCA1CN_CCF7__SET      0x02 ///< A match or capture occurred on Channel 7.      
                                                                                       
#define PCA1CN_CCF8__BMASK    0x04 ///< PCA Module 8 Capture/Compare Flag              
#define PCA1CN_CCF8__SHIFT    0x02 ///< PCA Module 8 Capture/Compare Flag              
#define PCA1CN_CCF8__NOT_SET  0x00 ///< A match or capture did not occur on Channel 8. 
#define PCA1CN_CCF8__SET      0x04 ///< A match or capture occurred on Channel 8.      
                                                                                       
#define PCA1CN_CCF9__BMASK    0x08 ///< PCA Module 9 Capture/Compare Flag              
#define PCA1CN_CCF9__SHIFT    0x03 ///< PCA Module 9 Capture/Compare Flag              
#define PCA1CN_CCF9__NOT_SET  0x00 ///< A match or capture did not occur on Channel 9. 
#define PCA1CN_CCF9__SET      0x08 ///< A match or capture occurred on Channel 9.      
                                                                                       
