ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define PCA1CN_CCF10__BMASK   0x10 ///< PCA Module 10 Capture/Compare Flag             
#define PCA1CN_CCF10__SHIFT   0x04 ///< PCA Module 10 Capture/Compare Flag             
#define PCA1CN_CCF10__NOT_SET 0x00 ///< A match or capture did not occur on Channel 10.
#define PCA1CN_CCF10__SET     0x10 ///< A match or capture occurred on Channel 10.     
                                                                                       
#define PCA1CN_CCF11__BMASK   0x20 ///< PCA Module 11 Capture/Compare Flag             
#define PCA1CN_CCF11__SHIFT   0x05 ///< PCA Module 11 Capture/Compare Flag             
#define PCA1CN_CCF11__NOT_SET 0x00 ///< A match or capture did not occur on Channel 11.
#define PCA1CN_CCF11__SET     0x20 ///< A match or capture occurred on Channel 11.     
                                                                                       
#define PCA1CN_CR__BMASK      0x40 ///< PCA Counter/Timer Run Control                  
#define PCA1CN_CR__SHIFT      0x06 ///< PCA Counter/Timer Run Control                  
#define PCA1CN_CR__STOP       0x00 ///< Stop the PCA Counter/Timer.                    
#define PCA1CN_CR__RUN        0x40 ///< Start the PCA Counter/Timer running.           
                                                                                       
#define PCA1CN_CF__BMASK      0x80 ///< PCA Counter/Timer Overflow Flag                
#define PCA1CN_CF__SHIFT      0x07 ///< PCA Counter/Timer Overflow Flag                
#define PCA1CN_CF__NOT_SET    0x00 ///< The PCA counter/timer did not overflow.        
#define PCA1CN_CF__SET        0x80 ///< The PCA counter/timer overflowed.              
                                                                                       
//------------------------------------------------------------------------------
// PCA1CPH10 Enums (PCA Channel 10 Capture Module High Byte @ 0xFE)
//------------------------------------------------------------------------------
#define PCA1CPH10_PCA1CPH10__FMASK 0xFF ///< PCA Channel 10 Capture Module High Byte
#define PCA1CPH10_PCA1CPH10__SHIFT 0x00 ///< PCA Channel 10 Capture Module High Byte
                                                                                    
//------------------------------------------------------------------------------
// PCA1CPH11 Enums (PCA Channel 11 Capture Module High Byte @ 0xCF)
//------------------------------------------------------------------------------
#define PCA1CPH11_PCA1CPH11__FMASK 0xFF ///< PCA Channel 11 Capture Module High Byte
#define PCA1CPH11_PCA1CPH11__SHIFT 0x00 ///< PCA Channel 11 Capture Module High Byte
                                                                                    
//------------------------------------------------------------------------------
// PCA1CPH6 Enums (PCA Channel 6 Capture Module High Byte @ 0xFC)
//------------------------------------------------------------------------------
#define PCA1CPH6_PCA1CPH6__FMASK 0xFF ///< PCA Channel 6 Capture Module High Byte
#define PCA1CPH6_PCA1CPH6__SHIFT 0x00 ///< PCA Channel 6 Capture Module High Byte
                                                                                 
//------------------------------------------------------------------------------
// PCA1CPH7 Enums (PCA Channel 7 Capture Module High Byte @ 0xEA)
//------------------------------------------------------------------------------
#define PCA1CPH7_PCA1CPH7__FMASK 0xFF ///< PCA Channel 7 Capture Module High Byte
#define PCA1CPH7_PCA1CPH7__SHIFT 0x00 ///< PCA Channel 7 Capture Module High Byte
                                                                                 
//------------------------------------------------------------------------------
// PCA1CPH8 Enums (PCA Channel 8 Capture Module High Byte @ 0xEC)
//------------------------------------------------------------------------------
#define PCA1CPH8_PCA1CPH8__FMASK 0xFF ///< PCA Channel 8 Capture Module High Byte
#define PCA1CPH8_PCA1CPH8__SHIFT 0x00 ///< PCA Channel 8 Capture Module High Byte
                                                                                 
//------------------------------------------------------------------------------
// PCA1CPH9 Enums (PCA Channel 9 Capture Module High Byte @ 0xEE)
//------------------------------------------------------------------------------
#define PCA1CPH9_PCA1CPH9__FMASK 0xFF ///< PCA Channel 9 Capture Module High Byte
#define PCA1CPH9_PCA1CPH9__SHIFT 0x00 ///< PCA Channel 9 Capture Module High Byte
                                                                                 
//------------------------------------------------------------------------------
// PCA1CPL10 Enums (PCA Channel 10 Capture Module Low Byte @ 0xFD)
//------------------------------------------------------------------------------
#define PCA1CPL10_PCA1CPL10__FMASK 0xFF ///< PCA Channel 10 Capture Module Low Byte
#define PCA1CPL10_PCA1CPL10__SHIFT 0x00 ///< PCA Channel 10 Capture Module Low Byte
                                                                                   
//------------------------------------------------------------------------------
// PCA1CPL11 Enums (PCA Channel 11 Capture Module Low Byte @ 0xCE)
//------------------------------------------------------------------------------
#define PCA1CPL11_PCA1CPL11__FMASK 0xFF ///< PCA Channel 11 Capture Module Low Byte
#define PCA1CPL11_PCA1CPL11__SHIFT 0x00 ///< PCA Channel 11 Capture Module Low Byte
                                                                                   
//------------------------------------------------------------------------------
// PCA1CPL6 Enums (PCA Channel 6 Capture Module Low Byte @ 0xFB)
//------------------------------------------------------------------------------
#define PCA1CPL6_PCA1CPL6__FMASK 0xFF ///< PCA Channel 6 Capture Module Low Byte
#define PCA1CPL6_PCA1CPL6__SHIFT 0x00 ///< PCA Channel 6 Capture Module Low Byte
                                                                                
//------------------------------------------------------------------------------
// PCA1CPL7 Enums (PCA Channel 7 Capture Module Low Byte @ 0xE9)
//------------------------------------------------------------------------------
#define PCA1CPL7_PCA1CPL7__FMASK 0xFF ///< PCA Channel 7 Capture Module Low Byte
#define PCA1CPL7_PCA1CPL7__SHIFT 0x00 ///< PCA Channel 7 Capture Module Low Byte
                                                                                
//------------------------------------------------------------------------------
// PCA1CPL8 Enums (PCA Channel 8 Capture Module Low Byte @ 0xEB)
//------------------------------------------------------------------------------
#define PCA1CPL8_PCA1CPL8__FMASK 0xFF ///< PCA Channel 8 Capture Module Low Byte
#define PCA1CPL8_PCA1CPL8__SHIFT 0x00 ///< PCA Channel 8 Capture Module Low Byte
                                                                                
//------------------------------------------------------------------------------
// PCA1CPL9 Enums (PCA Channel 9 Capture Module Low Byte @ 0xED)
//------------------------------------------------------------------------------
#define PCA1CPL9_PCA1CPL9__FMASK 0xFF ///< PCA Channel 9 Capture Module Low Byte
#define PCA1CPL9_PCA1CPL9__SHIFT 0x00 ///< PCA Channel 9 Capture Module Low Byte
                                                                                
//------------------------------------------------------------------------------
// PCA1CPM10 Enums (PCA Channel 10 Capture/Compare Mode @ 0xDE)
//------------------------------------------------------------------------------
#define PCA1CPM10_ECCF__BMASK    0x01 ///< Channel 10 Capture/Compare Flag Interrupt Enable
#define PCA1CPM10_ECCF__SHIFT    0x00 ///< Channel 10 Capture/Compare Flag Interrupt Enable
#define PCA1CPM10_ECCF__DISABLED 0x00 ///< Disable CCF10 interrupts.                       
#define PCA1CPM10_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request 
                                      ///< when CCF10 is set.                              
                                                                                           
#define PCA1CPM10_PWM__BMASK     0x02 ///< Channel 10 Pulse Width Modulation Mode Enable   
#define PCA1CPM10_PWM__SHIFT     0x01 ///< Channel 10 Pulse Width Modulation Mode Enable   
#define PCA1CPM10_PWM__DISABLED  0x00 ///< Disable PWM function.                           
#define PCA1CPM10_PWM__ENABLED   0x02 ///< Enable PWM function.                            
                                                                                           
#define PCA1CPM10_TOG__BMASK     0x04 ///< Channel 10 Toggle Function Enable               
#define PCA1CPM10_TOG__SHIFT     0x02 ///< Channel 10 Toggle Function Enable               
#define PCA1CPM10_TOG__DISABLED  0x00 ///< Disable toggle function.                        
#define PCA1CPM10_TOG__ENABLED   0x04 ///< Enable toggle function.                         
                                                                                           
