ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define PCA1CPM10_MAT__BMASK     0x08 ///< Channel 10 Match Function Enable                
#define PCA1CPM10_MAT__SHIFT     0x03 ///< Channel 10 Match Function Enable                
#define PCA1CPM10_MAT__DISABLED  0x00 ///< Disable match function.                         
#define PCA1CPM10_MAT__ENABLED   0x08 ///< Enable match function.                          
                                                                                           
#define PCA1CPM10_CAPN__BMASK    0x10 ///< Channel 10 Capture Negative Function Enable     
#define PCA1CPM10_CAPN__SHIFT    0x04 ///< Channel 10 Capture Negative Function Enable     
#define PCA1CPM10_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                  
#define PCA1CPM10_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                   
                                                                                           
#define PCA1CPM10_CAPP__BMASK    0x20 ///< Channel 10 Capture Positive Function Enable     
#define PCA1CPM10_CAPP__SHIFT    0x05 ///< Channel 10 Capture Positive Function Enable     
#define PCA1CPM10_CAPP__DISABLED 0x00 ///< Disable positive edge capture.                  
#define PCA1CPM10_CAPP__ENABLED  0x20 ///< Enable positive edge capture.                   
                                                                                           
#define PCA1CPM10_ECOM__BMASK    0x40 ///< Channel 10 Comparator Function Enable           
#define PCA1CPM10_ECOM__SHIFT    0x06 ///< Channel 10 Comparator Function Enable           
#define PCA1CPM10_ECOM__DISABLED 0x00 ///< Disable comparator function.                    
#define PCA1CPM10_ECOM__ENABLED  0x40 ///< Enable comparator function.                     
                                                                                           
#define PCA1CPM10_PWM16__BMASK   0x80 ///< Channel 10 16-bit Pulse Width Modulation Enable 
#define PCA1CPM10_PWM16__SHIFT   0x07 ///< Channel 10 16-bit Pulse Width Modulation Enable 
#define PCA1CPM10_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.                       
#define PCA1CPM10_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.                            
                                                                                           
//------------------------------------------------------------------------------
// PCA1CPM11 Enums (PCA Channel 11 Capture/Compare Mode @ 0xDF)
//------------------------------------------------------------------------------
#define PCA1CPM11_ECCF__BMASK    0x01 ///< Channel 11 Capture/Compare Flag Interrupt Enable
#define PCA1CPM11_ECCF__SHIFT    0x00 ///< Channel 11 Capture/Compare Flag Interrupt Enable
#define PCA1CPM11_ECCF__DISABLED 0x00 ///< Disable CCF11 interrupts.                       
#define PCA1CPM11_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request 
                                      ///< when CCF11 is set.                              
                                                                                           
#define PCA1CPM11_PWM__BMASK     0x02 ///< Channel 11 Pulse Width Modulation Mode Enable   
#define PCA1CPM11_PWM__SHIFT     0x01 ///< Channel 11 Pulse Width Modulation Mode Enable   
#define PCA1CPM11_PWM__DISABLED  0x00 ///< Disable PWM function.                           
#define PCA1CPM11_PWM__ENABLED   0x02 ///< Enable PWM function.                            
                                                                                           
#define PCA1CPM11_TOG__BMASK     0x04 ///< Channel 11 Toggle Function Enable               
#define PCA1CPM11_TOG__SHIFT     0x02 ///< Channel 11 Toggle Function Enable               
#define PCA1CPM11_TOG__DISABLED  0x00 ///< Disable toggle function.                        
#define PCA1CPM11_TOG__ENABLED   0x04 ///< Enable toggle function.                         
                                                                                           
#define PCA1CPM11_MAT__BMASK     0x08 ///< Channel 11 Match Function Enable                
#define PCA1CPM11_MAT__SHIFT     0x03 ///< Channel 11 Match Function Enable                
#define PCA1CPM11_MAT__DISABLED  0x00 ///< Disable match function.                         
#define PCA1CPM11_MAT__ENABLED   0x08 ///< Enable match function.                          
                                                                                           
#define PCA1CPM11_CAPN__BMASK    0x10 ///< Channel 11 Capture Negative Function Enable     
#define PCA1CPM11_CAPN__SHIFT    0x04 ///< Channel 11 Capture Negative Function Enable     
#define PCA1CPM11_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                  
#define PCA1CPM11_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                   
                                                                                           
#define PCA1CPM11_CAPP__BMASK    0x20 ///< Channel 11 Capture Positive Function Enable     
#define PCA1CPM11_CAPP__SHIFT    0x05 ///< Channel 11 Capture Positive Function Enable     
#define PCA1CPM11_CAPP__DISABLED 0x00 ///< Disable positive edge capture.                  
#define PCA1CPM11_CAPP__ENABLED  0x20 ///< Enable positive edge capture.                   
                                                                                           
#define PCA1CPM11_ECOM__BMASK    0x40 ///< Channel 11 Comparator Function Enable           
#define PCA1CPM11_ECOM__SHIFT    0x06 ///< Channel 11 Comparator Function Enable           
#define PCA1CPM11_ECOM__DISABLED 0x00 ///< Disable comparator function.                    
#define PCA1CPM11_ECOM__ENABLED  0x40 ///< Enable comparator function.                     
                                                                                           
#define PCA1CPM11_PWM16__BMASK   0x80 ///< Channel 11 16-bit Pulse Width Modulation Enable 
#define PCA1CPM11_PWM16__SHIFT   0x07 ///< Channel 11 16-bit Pulse Width Modulation Enable 
#define PCA1CPM11_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.                       
#define PCA1CPM11_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.                            
                                                                                           
//------------------------------------------------------------------------------
// PCA1CPM6 Enums (PCA Channel 6 Capture/Compare Mode @ 0xDA)
//------------------------------------------------------------------------------
#define PCA1CPM6_ECCF__BMASK    0x01 ///< Channel 6 Capture/Compare Flag Interrupt Enable
#define PCA1CPM6_ECCF__SHIFT    0x00 ///< Channel 6 Capture/Compare Flag Interrupt Enable
#define PCA1CPM6_ECCF__DISABLED 0x00 ///< Disable CCF6 interrupts.                       
#define PCA1CPM6_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF6 is set.                              
                                                                                         
