ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define PCA1CPM6_PWM__BMASK     0x02 ///< Channel 6 Pulse Width Modulation Mode Enable   
#define PCA1CPM6_PWM__SHIFT     0x01 ///< Channel 6 Pulse Width Modulation Mode Enable   
#define PCA1CPM6_PWM__DISABLED  0x00 ///< Disable PWM function.                          
#define PCA1CPM6_PWM__ENABLED   0x02 ///< Enable PWM function.                           
                                                                                         
#define PCA1CPM6_TOG__BMASK     0x04 ///< Channel 6 Toggle Function Enable               
#define PCA1CPM6_TOG__SHIFT     0x02 ///< Channel 6 Toggle Function Enable               
#define PCA1CPM6_TOG__DISABLED  0x00 ///< Disable toggle function.                       
#define PCA1CPM6_TOG__ENABLED   0x04 ///< Enable toggle function.                        
                                                                                         
#define PCA1CPM6_MAT__BMASK     0x08 ///< Channel 6 Match Function Enable                
#define PCA1CPM6_MAT__SHIFT     0x03 ///< Channel 6 Match Function Enable                
#define PCA1CPM6_MAT__DISABLED  0x00 ///< Disable match function.                        
#define PCA1CPM6_MAT__ENABLED   0x08 ///< Enable match function.                         
                                                                                         
#define PCA1CPM6_CAPN__BMASK    0x10 ///< Channel 6 Capture Negative Function Enable     
#define PCA1CPM6_CAPN__SHIFT    0x04 ///< Channel 6 Capture Negative Function Enable     
#define PCA1CPM6_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                 
#define PCA1CPM6_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                  
                                                                                         
#define PCA1CPM6_CAPP__BMASK    0x20 ///< Channel 6 Capture Positive Function Enable     
#define PCA1CPM6_CAPP__SHIFT    0x05 ///< Channel 6 Capture Positive Function Enable     
#define PCA1CPM6_CAPP__DISABLED 0x00 ///< Disable positive edge capture.                 
#define PCA1CPM6_CAPP__ENABLED  0x20 ///< Enable positive edge capture.                  
                                                                                         
#define PCA1CPM6_ECOM__BMASK    0x40 ///< Channel 6 Comparator Function Enable           
#define PCA1CPM6_ECOM__SHIFT    0x06 ///< Channel 6 Comparator Function Enable           
#define PCA1CPM6_ECOM__DISABLED 0x00 ///< Disable comparator function.                   
#define PCA1CPM6_ECOM__ENABLED  0x40 ///< Enable comparator function.                    
                                                                                         
#define PCA1CPM6_PWM16__BMASK   0x80 ///< Channel 6 16-bit Pulse Width Modulation Enable 
#define PCA1CPM6_PWM16__SHIFT   0x07 ///< Channel 6 16-bit Pulse Width Modulation Enable 
#define PCA1CPM6_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.                      
#define PCA1CPM6_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.                           
                                                                                         
//------------------------------------------------------------------------------
// PCA1CPM7 Enums (PCA Channel 7 Capture/Compare Mode @ 0xDB)
//------------------------------------------------------------------------------
#define PCA1CPM7_ECCF__BMASK    0x01 ///< Channel 7 Capture/Compare Flag Interrupt Enable
#define PCA1CPM7_ECCF__SHIFT    0x00 ///< Channel 7 Capture/Compare Flag Interrupt Enable
#define PCA1CPM7_ECCF__DISABLED 0x00 ///< Disable CCF7 interrupts.                       
#define PCA1CPM7_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF7 is set.                              
                                                                                         
#define PCA1CPM7_PWM__BMASK     0x02 ///< Channel 7 Pulse Width Modulation Mode Enable   
#define PCA1CPM7_PWM__SHIFT     0x01 ///< Channel 7 Pulse Width Modulation Mode Enable   
#define PCA1CPM7_PWM__DISABLED  0x00 ///< Disable PWM function.                          
#define PCA1CPM7_PWM__ENABLED   0x02 ///< Enable PWM function.                           
                                                                                         
#define PCA1CPM7_TOG__BMASK     0x04 ///< Channel 7 Toggle Function Enable               
#define PCA1CPM7_TOG__SHIFT     0x02 ///< Channel 7 Toggle Function Enable               
#define PCA1CPM7_TOG__DISABLED  0x00 ///< Disable toggle function.                       
#define PCA1CPM7_TOG__ENABLED   0x04 ///< Enable toggle function.                        
                                                                                         
#define PCA1CPM7_MAT__BMASK     0x08 ///< Channel 7 Match Function Enable                
#define PCA1CPM7_MAT__SHIFT     0x03 ///< Channel 7 Match Function Enable                
#define PCA1CPM7_MAT__DISABLED  0x00 ///< Disable match function.                        
#define PCA1CPM7_MAT__ENABLED   0x08 ///< Enable match function.                         
                                                                                         
#define PCA1CPM7_CAPN__BMASK    0x10 ///< Channel 7 Capture Negative Function Enable     
#define PCA1CPM7_CAPN__SHIFT    0x04 ///< Channel 7 Capture Negative Function Enable     
#define PCA1CPM7_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                 
#define PCA1CPM7_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                  
                                                                                         
#define PCA1CPM7_CAPP__BMASK    0x20 ///< Channel 7 Capture Positive Function Enable     
#define PCA1CPM7_CAPP__SHIFT    0x05 ///< Channel 7 Capture Positive Function Enable     
#define PCA1CPM7_CAPP__DISABLED 0x00 ///< Disable positive edge capture.                 
#define PCA1CPM7_CAPP__ENABLED  0x20 ///< Enable positive edge capture.                  
                                                                                         
#define PCA1CPM7_ECOM__BMASK    0x40 ///< Channel 7 Comparator Function Enable           
#define PCA1CPM7_ECOM__SHIFT    0x06 ///< Channel 7 Comparator Function Enable           
#define PCA1CPM7_ECOM__DISABLED 0x00 ///< Disable comparator function.                   
#define PCA1CPM7_ECOM__ENABLED  0x40 ///< Enable comparator function.                    
                                                                                         
#define PCA1CPM7_PWM16__BMASK   0x80 ///< Channel 7 16-bit Pulse Width Modulation Enable 
#define PCA1CPM7_PWM16__SHIFT   0x07 ///< Channel 7 16-bit Pulse Width Modulation Enable 
#define PCA1CPM7_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.                      
#define PCA1CPM7_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.                           
                                                                                         
//------------------------------------------------------------------------------
// PCA1CPM8 Enums (PCA Channel 8 Capture/Compare Mode @ 0xDC)
//------------------------------------------------------------------------------
#define PCA1CPM8_ECCF__BMASK    0x01 ///< Channel 8 Capture/Compare Flag Interrupt Enable
#define PCA1CPM8_ECCF__SHIFT    0x00 ///< Channel 8 Capture/Compare Flag Interrupt Enable
#define PCA1CPM8_ECCF__DISABLED 0x00 ///< Disable CCF8 interrupts.                       
#define PCA1CPM8_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF8 is set.                              
                                                                                         
