ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define PCA1CPM8_PWM__BMASK     0x02 ///< Channel 8 Pulse Width Modulation Mode Enable   
#define PCA1CPM8_PWM__SHIFT     0x01 ///< Channel 8 Pulse Width Modulation Mode Enable   
#define PCA1CPM8_PWM__DISABLED  0x00 ///< Disable PWM function.                          
#define PCA1CPM8_PWM__ENABLED   0x02 ///< Enable PWM function.                           
                                                                                         
#define PCA1CPM8_TOG__BMASK     0x04 ///< Channel 8 Toggle Function Enable               
#define PCA1CPM8_TOG__SHIFT     0x02 ///< Channel 8 Toggle Function Enable               
#define PCA1CPM8_TOG__DISABLED  0x00 ///< Disable toggle function.                       
#define PCA1CPM8_TOG__ENABLED   0x04 ///< Enable toggle function.                        
                                                                                         
#define PCA1CPM8_MAT__BMASK     0x08 ///< Channel 8 Match Function Enable                
#define PCA1CPM8_MAT__SHIFT     0x03 ///< Channel 8 Match Function Enable                
#define PCA1CPM8_MAT__DISABLED  0x00 ///< Disable match function.                        
#define PCA1CPM8_MAT__ENABLED   0x08 ///< Enable match function.                         
                                                                                         
#define PCA1CPM8_CAPN__BMASK    0x10 ///< Channel 8 Capture Negative Function Enable     
#define PCA1CPM8_CAPN__SHIFT    0x04 ///< Channel 8 Capture Negative Function Enable     
#define PCA1CPM8_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                 
#define PCA1CPM8_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                  
                                                                                         
#define PCA1CPM8_CAPP__BMASK    0x20 ///< Channel 8 Capture Positive Function Enable     
#define PCA1CPM8_CAPP__SHIFT    0x05 ///< Channel 8 Capture Positive Function Enable     
#define PCA1CPM8_CAPP__DISABLED 0x00 ///< Disable positive edge capture.                 
#define PCA1CPM8_CAPP__ENABLED  0x20 ///< Enable positive edge capture.                  
                                                                                         
#define PCA1CPM8_ECOM__BMASK    0x40 ///< Channel 8 Comparator Function Enable           
#define PCA1CPM8_ECOM__SHIFT    0x06 ///< Channel 8 Comparator Function Enable           
#define PCA1CPM8_ECOM__DISABLED 0x00 ///< Disable comparator function.                   
#define PCA1CPM8_ECOM__ENABLED  0x40 ///< Enable comparator function.                    
                                                                                         
#define PCA1CPM8_PWM16__BMASK   0x80 ///< Channel 8 16-bit Pulse Width Modulation Enable 
#define PCA1CPM8_PWM16__SHIFT   0x07 ///< Channel 8 16-bit Pulse Width Modulation Enable 
#define PCA1CPM8_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.                      
#define PCA1CPM8_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.                           
                                                                                         
//------------------------------------------------------------------------------
// PCA1CPM9 Enums (PCA Channel 9 Capture/Compare Mode @ 0xDD)
//------------------------------------------------------------------------------
#define PCA1CPM9_ECCF__BMASK    0x01 ///< Channel 9 Capture/Compare Flag Interrupt Enable
#define PCA1CPM9_ECCF__SHIFT    0x00 ///< Channel 9 Capture/Compare Flag Interrupt Enable
#define PCA1CPM9_ECCF__DISABLED 0x00 ///< Disable CCF9 interrupts.                       
#define PCA1CPM9_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF9 is set.                              
                                                                                         
#define PCA1CPM9_PWM__BMASK     0x02 ///< Channel 9 Pulse Width Modulation Mode Enable   
#define PCA1CPM9_PWM__SHIFT     0x01 ///< Channel 9 Pulse Width Modulation Mode Enable   
#define PCA1CPM9_PWM__DISABLED  0x00 ///< Disable PWM function.                          
#define PCA1CPM9_PWM__ENABLED   0x02 ///< Enable PWM function.                           
                                                                                         
#define PCA1CPM9_TOG__BMASK     0x04 ///< Channel 9 Toggle Function Enable               
#define PCA1CPM9_TOG__SHIFT     0x02 ///< Channel 9 Toggle Function Enable               
#define PCA1CPM9_TOG__DISABLED  0x00 ///< Disable toggle function.                       
#define PCA1CPM9_TOG__ENABLED   0x04 ///< Enable toggle function.                        
                                                                                         
#define PCA1CPM9_MAT__BMASK     0x08 ///< Channel 9 Match Function Enable                
#define PCA1CPM9_MAT__SHIFT     0x03 ///< Channel 9 Match Function Enable                
#define PCA1CPM9_MAT__DISABLED  0x00 ///< Disable match function.                        
#define PCA1CPM9_MAT__ENABLED   0x08 ///< Enable match function.                         
                                                                                         
#define PCA1CPM9_CAPN__BMASK    0x10 ///< Channel 9 Capture Negative Function Enable     
#define PCA1CPM9_CAPN__SHIFT    0x04 ///< Channel 9 Capture Negative Function Enable     
#define PCA1CPM9_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                 
#define PCA1CPM9_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                  
                                                                                         
#define PCA1CPM9_CAPP__BMASK    0x20 ///< Channel 9 Capture Positive Function Enable     
#define PCA1CPM9_CAPP__SHIFT    0x05 ///< Channel 9 Capture Positive Function Enable     
#define PCA1CPM9_CAPP__DISABLED 0x00 ///< Disable positive edge capture.                 
#define PCA1CPM9_CAPP__ENABLED  0x20 ///< Enable positive edge capture.                  
                                                                                         
#define PCA1CPM9_ECOM__BMASK    0x40 ///< Channel 9 Comparator Function Enable           
#define PCA1CPM9_ECOM__SHIFT    0x06 ///< Channel 9 Comparator Function Enable           
#define PCA1CPM9_ECOM__DISABLED 0x00 ///< Disable comparator function.                   
#define PCA1CPM9_ECOM__ENABLED  0x40 ///< Enable comparator function.                    
                                                                                         
#define PCA1CPM9_PWM16__BMASK   0x80 ///< Channel 9 16-bit Pulse Width Modulation Enable 
#define PCA1CPM9_PWM16__SHIFT   0x07 ///< Channel 9 16-bit Pulse Width Modulation Enable 
#define PCA1CPM9_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.                      
#define PCA1CPM9_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.                           
                                                                                         
//------------------------------------------------------------------------------
// PCA1H Enums (PCA Counter/Timer High Byte @ 0xFA)
//------------------------------------------------------------------------------
#define PCA1H_PCA1H__FMASK 0xFF ///< PCA Counter/Timer High Byte
#define PCA1H_PCA1H__SHIFT 0x00 ///< PCA Counter/Timer High Byte
                                                                
//------------------------------------------------------------------------------
// PCA1L Enums (PCA Counter/Timer Low Byte @ 0xF9)
//------------------------------------------------------------------------------
#define PCA1L_PCA1L__FMASK 0xFF ///< PCA Counter/Timer Low Byte
#define PCA1L_PCA1L__SHIFT 0x00 ///< PCA Counter/Timer Low Byte
                                                               
//------------------------------------------------------------------------------
// PCA1MD Enums (PCA Mode @ 0xD9)
//------------------------------------------------------------------------------
#define PCA1MD_ECF__BMASK            0x01 ///< PCA Counter/Timer Overflow Interrupt Enable       
#define PCA1MD_ECF__SHIFT            0x00 ///< PCA Counter/Timer Overflow Interrupt Enable       
#define PCA1MD_ECF__OVF_INT_DISABLED 0x00 ///< Disable the CF interrupt.                         
#define PCA1MD_ECF__OVF_INT_ENABLED  0x01 ///< Enable a PCA Counter/Timer Overflow interrupt     
                                          ///< request when CF (PCA1CN.7) is set.                
                                                                                                 
