ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define PCA1MD_CPS__FMASK            0x0E ///< PCA Counter/Timer Pulse Select                    
#define PCA1MD_CPS__SHIFT            0x01 ///< PCA Counter/Timer Pulse Select                    
#define PCA1MD_CPS__SYSCLK_DIV_12    0x00 ///< System clock divided by 12.                       
#define PCA1MD_CPS__SYSCLK_DIV_4     0x02 ///< System clock divided by 4.                        
#define PCA1MD_CPS__T0_OVERFLOW      0x04 ///< Timer 0 overflow.                                 
#define PCA1MD_CPS__ECI              0x06 ///< High-to-low transitions on ECI (max rate = system 
                                          ///< clock divided by 4).                              
#define PCA1MD_CPS__SYSCLK           0x08 ///< System clock.                                     
#define PCA1MD_CPS__EXTOSC_DIV_8     0x0A ///< External clock divided by 8 (synchronized with the
                                          ///< system clock).                                    
#define PCA1MD_CPS__RTC_DIV_8        0x0C ///< RTC divided by 8.                                 
                                                                                                 
#define PCA1MD_WDLCK__BMASK          0x20 ///< Watchdog Timer Lock                               
#define PCA1MD_WDLCK__SHIFT          0x05 ///< Watchdog Timer Lock                               
#define PCA1MD_WDLCK__UNLOCKED       0x00 ///< Watchdog Timer Enable unlocked.                   
#define PCA1MD_WDLCK__LOCKED         0x20 ///< Watchdog Timer Enable locked.                     
                                                                                                 
#define PCA1MD_WDTE__BMASK           0x40 ///< Watchdog Timer Enable                             
#define PCA1MD_WDTE__SHIFT           0x06 ///< Watchdog Timer Enable                             
#define PCA1MD_WDTE__DISABLED        0x00 ///< Disable Watchdog Timer.                           
#define PCA1MD_WDTE__ENABLED         0x40 ///< Enable PCA Module 2 as the Watchdog Timer.        
                                                                                                 
#define PCA1MD_CIDL__BMASK           0x80 ///< PCA Counter/Timer Idle Control                    
#define PCA1MD_CIDL__SHIFT           0x07 ///< PCA Counter/Timer Idle Control                    
#define PCA1MD_CIDL__NORMAL          0x00 ///< PCA continues to function normally while the      
                                          ///< system controller is in Idle Mode.                
#define PCA1MD_CIDL__SUSPEND         0x80 ///< PCA operation is suspended while the system       
                                          ///< controller is in Idle Mode.                       
                                                                                                 
//------------------------------------------------------------------------------
// PCA1PWM Enums (PCA PWM Configuration @ 0xDA)
//------------------------------------------------------------------------------
#define PCA1PWM_CLSEL__FMASK             0x03 ///< Cycle Length Select                              
#define PCA1PWM_CLSEL__SHIFT             0x00 ///< Cycle Length Select                              
#define PCA1PWM_CLSEL__8_BITS            0x00 ///< 8 bits.                                          
#define PCA1PWM_CLSEL__9_BITS            0x01 ///< 9 bits.                                          
#define PCA1PWM_CLSEL__10_BITS           0x02 ///< 10 bits.                                         
#define PCA1PWM_CLSEL__11_BITS           0x03 ///< 11 bits.                                         
                                                                                                    
#define PCA1PWM_COVF__BMASK              0x20 ///< Cycle Overflow Flag                              
#define PCA1PWM_COVF__SHIFT              0x05 ///< Cycle Overflow Flag                              
#define PCA1PWM_COVF__NO_OVERFLOW        0x00 ///< No overflow has occurred since the last time this
                                              ///< bit was cleared.                                 
#define PCA1PWM_COVF__OVERFLOW           0x20 ///< An overflow has occurred since the last time this
                                              ///< bit was cleared.                                 
                                                                                                    
#define PCA1PWM_ECOV__BMASK              0x40 ///< Cycle Overflow Interrupt Enable                  
#define PCA1PWM_ECOV__SHIFT              0x06 ///< Cycle Overflow Interrupt Enable                  
#define PCA1PWM_ECOV__COVF_MASK_DISABLED 0x00 ///< COVF will not generate PCA interrupts.           
#define PCA1PWM_ECOV__COVF_MASK_ENABLED  0x40 ///< A PCA interrupt will be generated when COVF is   
                                              ///< set.                                             
                                                                                                    
#define PCA1PWM_ARSEL__BMASK             0x80 ///< Auto-Reload Register Select                      
#define PCA1PWM_ARSEL__SHIFT             0x07 ///< Auto-Reload Register Select                      
#define PCA1PWM_ARSEL__CAPTURE_COMPARE   0x00 ///< Read/Write Capture/Compare Registers at PCA1CPHn 
                                              ///< and PCA1CPLn.                                    
#define PCA1PWM_ARSEL__AUTORELOAD        0x80 ///< Read/Write Auto-Reload Registers at PCA1CPHn and 
                                              ///< PCA1CPLn.                                        
                                                                                                    
//------------------------------------------------------------------------------
// PCON Enums (Power Control @ 0x87)
//------------------------------------------------------------------------------
#define PCON_IDLE__BMASK  0x01 ///< Idle Mode Select                                
#define PCON_IDLE__SHIFT  0x00 ///< Idle Mode Select                                
#define PCON_IDLE__NORMAL 0x00 ///< Idle mode not activated.                        
#define PCON_IDLE__IDLE   0x01 ///< CPU goes into Idle mode (shuts off clock to CPU,
                               ///< but clocks to enabled peripherals are still     
                               ///< active).                                        
                                                                                    
