ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define TMR4CF_TOG4__BMASK                  0x04 ///< Toggle Output State                              
#define TMR4CF_TOG4__SHIFT                  0x02 ///< Toggle Output State                              
#define TMR4CF_TOG4__LOW                    0x00 ///< Output is low or force the T4 output low.        
#define TMR4CF_TOG4__HIGH                   0x04 ///< Output is high or force the T4 output high.      
                                                                                                       
#define TMR4CF_T4M__FMASK                   0x18 ///< Clock Mode Select                                
#define TMR4CF_T4M__SHIFT                   0x03 ///< Clock Mode Select                                
#define TMR4CF_T4M__SYSCLK_DIV_12           0x00 ///< Timer 4 clock is SYSCLK / 12.                    
#define TMR4CF_T4M__SYSCLK                  0x08 ///< Timer 4 clock is SYSCLK.                         
#define TMR4CF_T4M__EXTOSC_DIV_8            0x10 ///< Timer 4 clock is EXTOSC / 8 (synchronized to the 
                                                 ///< system clock).                                   
#define TMR4CF_T4M__SYSCLK_DIV_2            0x18 ///< Timer 4 clock is SYSCLK / 2.                     
                                                                                                       
//------------------------------------------------------------------------------
// TMR4CN Enums (Timer 4 Control @ 0xC8)
//------------------------------------------------------------------------------
#define TMR4CN_CPRL4__BMASK          0x01 ///< Capture / Reload Select                           
#define TMR4CN_CPRL4__SHIFT          0x00 ///< Capture / Reload Select                           
#define TMR4CN_CPRL4__AUTO_RELOAD    0x00 ///< Timer 4 is in auto-reload mode.                   
#define TMR4CN_CPRL4__CAPTURE        0x01 ///< Timer 4 is in capture mode.                       
                                                                                                 
#define TMR4CN_CT4__BMASK            0x02 ///< Counter / Timer Select                            
#define TMR4CN_CT4__SHIFT            0x01 ///< Counter / Timer Select                            
#define TMR4CN_CT4__TIMER            0x00 ///< Timer function: the timer increments by the clock 
                                          ///< defined in the T4M bits in the TMR4CF register.   
#define TMR4CN_CT4__COUNTER          0x02 ///< Counter function: the timer increments by high-to-
                                          ///< low transitions on the T4EX pin.                  
                                                                                                 
#define TMR4CN_TR4__BMASK            0x04 ///< Timer 4 Run Control                               
#define TMR4CN_TR4__SHIFT            0x02 ///< Timer 4 Run Control                               
#define TMR4CN_TR4__STOP             0x00 ///< Stop Timer 4.                                     
#define TMR4CN_TR4__RUN              0x04 ///< Start Timer 4 running.                            
                                                                                                 
#define TMR4CN_EXE4__BMASK           0x08 ///< Timer 4 External Enable                           
#define TMR4CN_EXE4__SHIFT           0x03 ///< Timer 4 External Enable                           
#define TMR4CN_EXE4__EX_PIN_DISABLED 0x00 ///< Transitions on the T4EX pin are ignored.          
#define TMR4CN_EXE4__EX_PIN_ENABLED  0x08 ///< Transitions on the T4EX pin cause capture, reload,
                                          ///< or control the direction of timer count (up or    
                                          ///< down).                                            
                                                                                                 
#define TMR4CN_EXF4__BMASK           0x40 ///< Timer 4 External Flag                             
#define TMR4CN_EXF4__SHIFT           0x06 ///< Timer 4 External Flag                             
#define TMR4CN_EXF4__NOT_SET         0x00 ///< Timer 4 capture or reload did not occur.          
#define TMR4CN_EXF4__SET             0x40 ///< Timer 4 capture or reload occurred.               
                                                                                                 
#define TMR4CN_TF4__BMASK            0x80 ///< Timer 4 Overflow or Underflow Flag                
#define TMR4CN_TF4__SHIFT            0x07 ///< Timer 4 Overflow or Underflow Flag                
#define TMR4CN_TF4__NOT_SET          0x00 ///< Timer 4 16-bit value did not overflow or          
                                          ///< underflow.                                        
#define TMR4CN_TF4__SET              0x80 ///< Timer 4 16-bit value overflowed or underflowed.   
                                                                                                 
//------------------------------------------------------------------------------
// TMR4H Enums (Timer 4 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR4H_TMR4H__FMASK 0xFF ///< Timer 4 High Byte
#define TMR4H_TMR4H__SHIFT 0x00 ///< Timer 4 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR4L Enums (Timer 4 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR4L_TMR4L__FMASK 0xFF ///< Timer 4 Low Byte
#define TMR4L_TMR4L__SHIFT 0x00 ///< Timer 4 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR5CAPH Enums (Timer 5 Reload High Byte @ 0x93)
//------------------------------------------------------------------------------
#define TMR5CAPH_TMR5CAPH__FMASK 0xFF ///< Timer 5 Reload High Byte
#define TMR5CAPH_TMR5CAPH__SHIFT 0x00 ///< Timer 5 Reload High Byte
                                                                   
//------------------------------------------------------------------------------
// TMR5CAPL Enums (Timer 5 Reload Low Byte @ 0x92)
//------------------------------------------------------------------------------
#define TMR5CAPL_TMR5CAPL__FMASK 0xFF ///< Timer 5 Reload Low Byte
#define TMR5CAPL_TMR5CAPL__SHIFT 0x00 ///< Timer 5 Reload Low Byte
                                                                  
//------------------------------------------------------------------------------
// TMR5CF Enums (Timer 5 Config @ 0x96)
//------------------------------------------------------------------------------
#define TMR5CF_DCEN5__BMASK                 0x01 ///< Decrement Enable                                 
#define TMR5CF_DCEN5__SHIFT                 0x00 ///< Decrement Enable                                 
#define TMR5CF_DCEN5__UP_ONLY               0x00 ///< Timer 5 will count up, regardless of the state of
                                                 ///< T5EX.                                            
#define TMR5CF_DCEN5__UP_OR_DOWN            0x01 ///< Timer 5 will count up if T5EX is high and count  
                                                 ///< down if T5EX is low.                             
                                                                                                       
#define TMR5CF_T5OE__BMASK                  0x02 ///< Output Enable                                    
#define TMR5CF_T5OE__SHIFT                  0x01 ///< Output Enable                                    
#define TMR5CF_T5OE__TOGGLE_OUTPUT_DISABLED 0x00 ///< The output of toggle mode is not available at the
                                                 ///< timer's assigned port pin.                       
#define TMR5CF_T5OE__TOGGLE_OUTPUT_ENABLED  0x02 ///< The output of toggle mode is available at the    
                                                 ///< timer's assigned port pin.                       
                                                                                                       
