ahtn/keyplus/efm8/efm8/mcu/C8051F580/inc/SI_C8051F580_Register_Enums.h
#define TMR5CF_TOG5__BMASK                  0x04 ///< Toggle Output State                              
#define TMR5CF_TOG5__SHIFT                  0x02 ///< Toggle Output State                              
#define TMR5CF_TOG5__LOW                    0x00 ///< Output is low or force the T5 output low.        
#define TMR5CF_TOG5__HIGH                   0x04 ///< Output is high or force the T5 output high.      
                                                                                                       
#define TMR5CF_T5M__FMASK                   0x18 ///< Clock Mode Select                                
#define TMR5CF_T5M__SHIFT                   0x03 ///< Clock Mode Select                                
#define TMR5CF_T5M__SYSCLK_DIV_12           0x00 ///< Timer 5 clock is SYSCLK / 12.                    
#define TMR5CF_T5M__SYSCLK                  0x08 ///< Timer 5 clock is SYSCLK.                         
#define TMR5CF_T5M__EXTOSC_DIV_8            0x10 ///< Timer 5 clock is EXTOSC / 8 (synchronized to the 
                                                 ///< system clock).                                   
#define TMR5CF_T5M__SYSCLK_DIV_2            0x18 ///< Timer 5 clock is SYSCLK / 2.                     
                                                                                                       
//------------------------------------------------------------------------------
// TMR5CN Enums (Timer 5 Control @ 0x91)
//------------------------------------------------------------------------------
#define TMR5CN_CPRL5__BMASK          0x01 ///< Capture / Reload Select                           
#define TMR5CN_CPRL5__SHIFT          0x00 ///< Capture / Reload Select                           
#define TMR5CN_CPRL5__AUTO_RELOAD    0x00 ///< Timer 5 is in auto-reload mode.                   
#define TMR5CN_CPRL5__CAPTURE        0x01 ///< Timer 5 is in capture mode.                       
                                                                                                 
#define TMR5CN_CT5__BMASK            0x02 ///< Counter / Timer Select                            
#define TMR5CN_CT5__SHIFT            0x01 ///< Counter / Timer Select                            
#define TMR5CN_CT5__TIMER            0x00 ///< Timer function: the timer increments by the clock 
                                          ///< defined in the T5M bits in the TMR5CF register.   
#define TMR5CN_CT5__COUNTER          0x02 ///< Counter function: the timer increments by high-to-
                                          ///< low transitions on the T5EX pin.                  
                                                                                                 
#define TMR5CN_TR5__BMASK            0x04 ///< Timer 5 Run Control                               
#define TMR5CN_TR5__SHIFT            0x02 ///< Timer 5 Run Control                               
#define TMR5CN_TR5__STOP             0x00 ///< Stop Timer 5.                                     
#define TMR5CN_TR5__RUN              0x04 ///< Start Timer 5 running.                            
                                                                                                 
#define TMR5CN_EXE5__BMASK           0x08 ///< Timer 5 External Enable                           
#define TMR5CN_EXE5__SHIFT           0x03 ///< Timer 5 External Enable                           
#define TMR5CN_EXE5__EX_PIN_DISABLED 0x00 ///< Transitions on the T5EX pin are ignored.          
#define TMR5CN_EXE5__EX_PIN_ENABLED  0x08 ///< Transitions on the T5EX pin cause capture, reload,
                                          ///< or control the direction of timer count (up or    
                                          ///< down).                                            
                                                                                                 
#define TMR5CN_EXF5__BMASK           0x40 ///< Timer 5 External Flag                             
#define TMR5CN_EXF5__SHIFT           0x06 ///< Timer 5 External Flag                             
#define TMR5CN_EXF5__NOT_SET         0x00 ///< Timer 5 capture or reload did not occur.          
#define TMR5CN_EXF5__SET             0x40 ///< Timer 5 capture or reload occurred.               
                                                                                                 
#define TMR5CN_TF5__BMASK            0x80 ///< Timer 5 Overflow or Underflow Flag                
#define TMR5CN_TF5__SHIFT            0x07 ///< Timer 5 Overflow or Underflow Flag                
#define TMR5CN_TF5__NOT_SET          0x00 ///< Timer 5 16-bit value did not overflow or          
                                          ///< underflow.                                        
#define TMR5CN_TF5__SET              0x80 ///< Timer 5 16-bit value overflowed or underflowed.   
                                                                                                 
//------------------------------------------------------------------------------
// TMR5H Enums (Timer 5 High Byte @ 0x95)
//------------------------------------------------------------------------------
#define TMR5H_TMR5H__FMASK 0xFF ///< Timer 5 High Byte
#define TMR5H_TMR5H__SHIFT 0x00 ///< Timer 5 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR5L Enums (Timer 5 Low Byte @ 0x94)
//------------------------------------------------------------------------------
#define TMR5L_TMR5L__FMASK 0xFF ///< Timer 5 Low Byte
#define TMR5L_TMR5L__SHIFT 0x00 ///< Timer 5 Low Byte
                                                     
//------------------------------------------------------------------------------
// CKCON Enums (Clock Control @ 0x8E)
//------------------------------------------------------------------------------
#define CKCON_SCA__FMASK           0x03 ///< Timer 0/1 Prescale                             
#define CKCON_SCA__SHIFT           0x00 ///< Timer 0/1 Prescale                             
#define CKCON_SCA__SYSCLK_DIV_12   0x00 ///< System clock divided by 12.                    
#define CKCON_SCA__SYSCLK_DIV_4    0x01 ///< System clock divided by 4.                     
#define CKCON_SCA__SYSCLK_DIV_48   0x02 ///< System clock divided by 48.                    
#define CKCON_SCA__EXTOSC_DIV_8    0x03 ///< External oscillator divided by 8 (synchronized 
                                        ///< with the system clock).                        
                                                                                            
#define CKCON_T0M__BMASK           0x04 ///< Timer 0 Clock Select                           
#define CKCON_T0M__SHIFT           0x02 ///< Timer 0 Clock Select                           
#define CKCON_T0M__PRESCALE        0x00 ///< Counter/Timer 0 uses the clock defined by the  
                                        ///< prescale field, SCA.                           
#define CKCON_T0M__SYSCLK          0x04 ///< Counter/Timer 0 uses the system clock.         
                                                                                            
#define CKCON_T1M__BMASK           0x08 ///< Timer 1 Clock Select                           
#define CKCON_T1M__SHIFT           0x03 ///< Timer 1 Clock Select                           
#define CKCON_T1M__PRESCALE        0x00 ///< Timer 1 uses the clock defined by the prescale 
                                        ///< field, SCA.                                    
#define CKCON_T1M__SYSCLK          0x08 ///< Timer 1 uses the system clock.                 
                                                                                            
